{"input": "3 bedrooms, 2 bathrooms, Sasolburg, pool, double garage, modern kitchen", "output": "This stunning 3-bedroom home in Sasolburg features a modern kitchen, sparkling pool, and a spacious double garage — perfect for growing families."}
{"input": "2 bedrooms, 1 bathroom, Vanderbijlpark, pet-friendly, open-plan kitchen", "output": "This cozy 2-bedroom home in Vanderbijlpark is perfect for first-time buyers, offering a pet-friendly garden and an open-plan kitchen for easy entertaining."}
{"input": "2 bedrooms, 1 bathroom, Wonderboom South, garden, garage, modern kitchen", "output": "Discover your ideal home in the highly sought-after area of Wonderboom South. This charming 2-bedroom townhouse features a spacious garden, a modern fully-fitted kitchen, and a secure lock-up garage. Perfect for small families, pet lovers, or first-time buyers looking for comfort and location."}
{"input": "4 bedrooms, 2 bathrooms, Noordwyk, Heron’s View Estate, office, garden, 2 garages, luxury estate", "output": "Experience luxury living in this 4-bedroom townhouse located in the prestigious Heron’s View Estate in Noordwyk, Midrand. Boasting a sleek high-tech kitchen, home office, beautiful garden with braai area, and 2 garages, this home is ideal for families and professionals seeking peace, security, and style."}
{"input": "4 bedrooms, 1 bathroom, Sunnyside, Afrimosa building, investment property, R11,000 rental income, Pretoria", "output": "This high-yield 4-bedroom apartment in the Afrimosa building, Sunnyside, offers R11,000 in monthly rental income. Strategically located near universities, hospitals, and public transport, it’s an ideal investment for buyers looking to secure a well-maintained, income-generating property in Pretoria."}
{"input": "2 bedrooms, 1 bathroom, Annlin, Pretoria, flatlet, 2nd floor, communal garden, braai area, under-roof parking", "output": "Discover this spacious 2-bedroom flatlet in the heart of Annlin, Pretoria. Positioned on the 2nd floor, it offers lock-up-and-go convenience with access to a communal garden and braai area. Ideal for professionals or small families, complete with secure under-roof parking and close to schools and major routes."}
{"input": "2 bedrooms, 1 bathroom, Pretoria North, modern apartment, granite kitchen, gas stove, full bathroom, balcony, undercover parking", "output": "This modern 2-bedroom apartment in Pretoria North offers a stylish kitchen with granite countertops and gas stove, a full bathroom, and a spacious balcony. Set in a secure complex with undercover parking, it's perfect for young professionals or investors seeking comfort and prime location."}
{"input": "4 bedrooms, 3 bathrooms, Amandasig, thatch roof, double garage, solar panels, study, large garden", "output": "This 4-bedroom thatch roof home in Amandasig blends natural charm with modern convenience. Enjoy spacious living areas, 3 bathrooms, a solid wood kitchen, and a separate study. Includes solar panels, a double garage, and a lush tropical garden on a fully walled stand. A peaceful retreat close to Wonderpark Mall and Akasia Hospital."}
{"input": "2 bedrooms, 1 bathroom, Theresa Park, Pretoria North, dining room, lounge, garden, Lapa, Wendy house", "output": "This charming 2-bedroom home in Theresa Park offers a comfortable lounge, separate dining room, and a well-kept garden. With a Lapa for entertaining and a Wendy house for extra storage, it’s the perfect family-friendly space in a peaceful Pretoria North neighborhood."}
{"input": "5 bedrooms, 3.5 bathrooms, Fairland, triple-level house, pool, wine cellar, theatre, underfloor heating, borehole, solar geysers", "output": "A triple-level masterpiece in Fairland offering luxury and space across 5 bedrooms and 3.5 bathrooms. Enjoy a gourmet kitchen, theatre room, wine cellar, and heated pool. This home features underfloor heating, solar geysers, and a borehole, making it the ultimate in elegance and efficiency."}
{"input": "4 bedrooms, 3 bathrooms, Paarl, Cape Winelands, luxury estate, equestrian facilities, golf course, mountain views", "output": "Luxury living in Paarl’s Cape Winelands with this 4-bedroom, 3-bathroom estate home featuring equestrian facilities, a Jack Nicklaus Signature Golf Course, and panoramic mountain views."}
{"input": "3 bedrooms, 2 bathrooms, Midrand, Waterfall View Estate, secure estate, urban location, landscaped parks", "output": "Experience serene suburban living in Midrand with this 3-bedroom home in Waterfall View Estate. Set in a secure community with landscaped parks and urban convenience."}
{"input": "4 bedrooms, 2 bathrooms, George, Kingswood Golf Estate, golf course, modern finishes, mountain views", "output": "Enjoy stylish golf-side living in Kingswood Golf Estate, George. This 4-bedroom, 2-bathroom home offers modern finishes and breathtaking Outeniqua Mountain views."}
{"input": "3 bedrooms, 2 bathrooms, Langebaan, coastal estate, golf course, beach access, trails", "output": "A stunning 3-bedroom home in Langebaan Country Estate offering beachside charm, Gary Player-designed golf course, and direct access to trails and natural beauty."}
{"input": "4 bedrooms, 3 bathrooms, Camps Bay, triple-storey, sea views, private pool, luxury finishes", "output": "This triple-storey 4-bedroom luxury villa in Camps Bay features floor-to-ceiling windows, a private pool, and uninterrupted Atlantic Ocean views—coastal luxury at its finest."}
{"input": "3 bedrooms, 2 bathrooms, Centurion, Copperleaf Estate, family estate, golf course, security estate", "output": "Family-friendly living in Copperleaf Estate, Centurion. This 3-bedroom home offers access to a championship golf course, parks, and top-notch estate security."}
{"input": "4 bedrooms, 2 bathrooms, Centurion, Bally Bunion Place, modern finishes, landscaped garden, lock-up-and-go", "output": "Sophisticated living in Bally Bunion Place, Centurion. This 4-bedroom home includes luxury finishes, a manicured garden, and lock-up-and-go convenience in a secure setting."}
{"input": "3 bedrooms, 2 bathrooms, Paarl, fire pit, gourmet kitchen, wine cellar potential, mountain backdrop", "output": "This 3-bedroom Paarl home offers a gourmet kitchen, cozy fire pit, and potential for a personal wine cellar—all set against a stunning mountain backdrop."}
{"input": "2 bedrooms, 1 bathroom, Langebaan, beach estate, coastal lifestyle, clubhouse, nature trails", "output": "Coastal elegance meets convenience in this 2-bedroom Langebaan home featuring access to pristine beaches, a clubhouse, and scenic nature trails."}
{"input": "4 bedrooms, 3 bathrooms, George, family estate, secure, play park, mountain view", "output": "Ideal for families, this 4-bedroom George home sits in a secure estate with mountain views, communal play parks, and peaceful streets for kids to roam."}
{"input": "2 bedrooms, 2 bathrooms, Camps Bay, oceanfront, infinity pool, designer finishes, sunset views", "output": "Wake up to oceanfront views in this Camps Bay 2-bedroom villa, complete with an infinity pool, luxury designer finishes, and panoramic sunset vistas."}
{"input": "3 bedrooms, 2 bathrooms, Midrand, Copperleaf Estate, double garage, garden, office space", "output": "Spacious 3-bedroom home in Copperleaf Estate, Midrand, featuring a double garage, lush garden, and a dedicated home office—perfect for work and play."}
{"input": "4 bedrooms, 3 bathrooms, George, Kingswood Golf Estate, family home, scenic estate, modern kitchen", "output": "This modern 4-bedroom Kingswood Golf Estate home in George is the perfect family retreat with scenic surroundings and a sleek, fully-equipped kitchen."}
{"input": "2 bedrooms, 1 bathroom, Langebaan, golf estate, compact living, security, beach access", "output": "Compact and stylish 2-bedroom unit in Langebaan Country Estate with secure living, golf course access, and short strolls to the beach."}
{"input": "3 bedrooms, 2.5 bathrooms, Paarl, wine estate, family living, scenic views, outdoor patio", "output": "Enjoy wine country living in this 3-bedroom Paarl home featuring an outdoor patio, scenic views, and access to one of the Winelands' most luxurious estates."}
{"input": "5 bedrooms, 3.5 bathrooms, Camps Bay, luxury villa, private cinema, heated pool, panoramic views", "output": "A 5-bedroom luxury villa in Camps Bay offering a private cinema, heated pool, and breathtaking views over the ocean—perfect for entertaining in style."}
{"input": "3 bedrooms, 2 bathrooms, George, estate living, energy-efficient, modern layout, garden", "output": "This energy-efficient 3-bedroom home in George offers a modern open-plan layout, manicured garden, and estate security for peace of mind."}
{"input": "4 bedrooms, 2 bathrooms, Centurion, golf estate, clubhouse access, lifestyle estate, solar ready", "output": "Live the lifestyle in this 4-bedroom Centurion home within a premium golf estate, offering clubhouse access and solar-ready design for sustainability."}
{"input": "2 bedrooms, 1 bathroom, Midrand, secure complex, close to schools, private garden, pet-friendly", "output": "Ideal starter home in Midrand! This 2-bedroom unit is in a secure complex with a private garden and pet-friendly policy—close to top schools and amenities."}
{"input": "3 bedrooms, 2 bathrooms, George, golf estate, community feel, smart features, garage", "output": "Located in a smart-enabled estate in George, this 3-bedroom home blends modern features with garage access and a warm community atmosphere."}
{"input": "3 bedrooms, 2 bathrooms, Durban North, sea views, open-plan kitchen, garden, double garage", "output": "This 3-bedroom home in Durban North offers stunning sea views, an open-plan kitchen, and a lush garden. Complete with 2 bathrooms and a double garage, it's perfect coastal living for the modern family."}
{"input": "2 bedrooms, 1 bathroom, Port Elizabeth, modern apartment, balcony, secure parking, ocean breeze", "output": "Modern 2-bedroom apartment in Port Elizabeth with a private balcony and secure parking. Enjoy light-filled interiors and ocean breezes in this sought-after coastal location."}
{"input": "4 bedrooms, 3 bathrooms, Bloemfontein, family home, entertainment area, pool, large yard", "output": "Spacious 4-bedroom family home in Bloemfontein featuring 3 bathrooms, an entertainment patio, pool, and a large yard for kids and pets to enjoy."}
{"input": "1 bedroom, 1 bathroom, Cape Town CBD, bachelor flat, city views, modern finish, ideal for investors", "output": "Modern bachelor flat in Cape Town CBD with panoramic city views and sleek finishes. A prime investment opportunity or ideal base for young professionals."}
{"input": "5 bedrooms, 4 bathrooms, Ballito, luxury coastal villa, infinity pool, private beach access", "output": "This luxurious 5-bedroom villa in Ballito offers 4 bathrooms, an infinity pool, and private beach access—designed for ultimate coastal indulgence."}
{"input": "3 bedrooms, 2 bathrooms, Mossel Bay, double-storey, ocean views, deck, lock-up garage", "output": "Double-storey home in Mossel Bay with 3 bedrooms, 2 bathrooms, ocean views, and a large deck—perfect for holiday living or permanent residence."}
{"input": "2 bedrooms, 1 bathroom, Polokwane, townhouse, pet-friendly, single garage, close to schools", "output": "Charming 2-bedroom townhouse in Polokwane, featuring a single garage, pet-friendly garden, and close proximity to top schools and amenities."}
{"input": "4 bedrooms, 3 bathrooms, Knysna, lagoon views, timber finishes, fireplace, gourmet kitchen", "output": "Nestled in Knysna, this 4-bedroom retreat features lagoon views, timber architecture, a cozy fireplace, and a gourmet kitchen for entertaining in style."}
{"input": "3 bedrooms, 2 bathrooms, East London, riverfront, open-plan living, undercover patio, jetty access", "output": "Riverfront living in East London! This 3-bedroom home offers open-plan living, an undercover patio, and direct jetty access for water activities."}
{"input": "2 bedrooms, 1 bathroom, Rustenburg, apartment, balcony, covered parking, investment unit", "output": "Investment-ready 2-bedroom apartment in Rustenburg featuring a balcony, covered parking, and proximity to transport and shops."}
{"input": "4 bedrooms, 2 bathrooms, Nelspruit, garden, patio, entertainment area, family home", "output": "A spacious family home in Nelspruit with 4 bedrooms, 2 bathrooms, and a well-kept garden with patio and braai area—ideal for entertaining."}
{"input": "3 bedrooms, 1.5 bathrooms, Kimberly, face brick house, garage, fenced yard, lounge", "output": "Solid face brick 3-bedroom home in Kimberly with a garage, secure fenced yard, and spacious lounge—move-in ready and great value."}
{"input": "2 bedrooms, 1 bathroom, Hermanus, retirement village, sea air, shared facilities, safe environment", "output": "Comfortable 2-bedroom unit in a Hermanus retirement village. Enjoy sea air, shared recreational facilities, and a peaceful, secure environment."}
{"input": "3 bedrooms, 2 bathrooms, Pietermaritzburg, duplex, garage, private courtyard, secure complex", "output": "This 3-bedroom duplex in Pietermaritzburg features 2 bathrooms, a private courtyard, and garage in a quiet, secure complex close to schools."}
{"input": "4 bedrooms, 3 bathrooms, Jeffreys Bay, beach home, braai area, sea view balcony, surfside location", "output": "Live by the waves in this 4-bedroom beach home in Jeffreys Bay with 3 bathrooms, a sea view balcony, and outdoor braai area for relaxed coastal living."}
{"input": "2 bedrooms, 2 bathrooms, Stellenbosch, student flat, walking distance to campus, secure block", "output": "Stylish 2-bedroom, 2-bathroom student flat in Stellenbosch just minutes from campus. Set in a secure block with excellent rental returns."}
{"input": "3 bedrooms, 2 bathrooms, Upington, face brick house, carport, water tank, low-maintenance garden", "output": "Neat and tidy 3-bedroom home in Upington with low-maintenance finishes, carport, water tank, and sunny living areas for relaxed desert living."}
{"input": "1 bedroom, 1 bathroom, Mthatha, apartment, open-plan kitchen, top floor, mountain views", "output": "Modern 1-bedroom apartment in Mthatha with mountain views from the top floor. Includes an open-plan kitchen and neat finishes throughout."}
{"input": "4 bedrooms, 3 bathrooms, Bethlehem, farm-style home, large plot, wraparound porch, peaceful living", "output": "Rustic charm in Bethlehem! This 4-bedroom, 3-bathroom farm-style home features a large wraparound porch and expansive plot for peaceful family life."}
{"input": "2 bedrooms, 1 bathroom, Mahikeng, apartment, carport, investment property, close to CBD", "output": "Ideal investment opportunity in Mahikeng! This 2-bedroom apartment includes a carport, tiled interiors, and close access to the CBD and transport."}
{"input": "3 bedrooms, 2 bathrooms, Alberton, duplex, pet-friendly, garage, secure complex", "output": "Charming 3-bedroom duplex in Alberton with pet-friendly features, a secure garage, and situated in a quiet, gated complex."}
{"input": "2 bedrooms, 1 bathroom, Potchefstroom, student accommodation, furnished, walking distance to university", "output": "Fully furnished 2-bedroom unit in Potchefstroom ideal for students. Located within walking distance of the university and designed for convenience and security."}
{"input": "4 bedrooms, 2.5 bathrooms, Vanderbijlpark, family home, entertainment area, garden, carport", "output": "Spacious 4-bedroom family home in Vanderbijlpark featuring a covered entertainment area, lush garden, and ample covered parking."}
{"input": "1 bedroom, 1 bathroom, Durban Central, apartment, ocean views, high-rise, secure access", "output": "Modern 1-bedroom apartment in a Durban Central high-rise with stunning ocean views and 24/7 secure access—perfect for professionals or investors."}
{"input": "3 bedrooms, 2 bathrooms, Paarl, townhouse, mountain views, balcony, open-plan layout", "output": "Townhouse living in scenic Paarl! This 3-bedroom, 2-bathroom unit features open-plan living, a sunny balcony, and majestic mountain views."}
{"input": "2 bedrooms, 1 bathroom, East London, apartment, sea breeze, lock-up garage, modern kitchen", "output": "This modern 2-bedroom apartment in East London offers fresh sea air, a fully equipped kitchen, and secure lock-up garage near the coast."}
{"input": "4 bedrooms, 3 bathrooms, Rustenburg, freestanding house, entertainment deck, swimming pool, garden", "output": "Freestanding 4-bedroom home in Rustenburg with a spacious entertainment deck, pool, and beautifully maintained garden—perfect for hosting."}
{"input": "2 bedrooms, 1 bathroom, Kimberley, townhouse, garage, tiled floors, close to shopping", "output": "Low-maintenance 2-bedroom townhouse in Kimberley with a tiled interior, garage, and proximity to shopping and schools."}
{"input": "3 bedrooms, 1 bathroom, Mthatha, house, fenced yard, paved driveway, quiet area", "output": "Affordable 3-bedroom house in Mthatha with a fenced yard, paved driveway, and located in a peaceful neighborhood."}
{"input": "5 bedrooms, 4 bathrooms, George, luxury home, mountain backdrop, double garage, pool", "output": "A stunning 5-bedroom luxury home in George featuring mountain views, a sparkling pool, and a double garage in an exclusive neighborhood."}
{"input": "2 bedrooms, 1 bathroom, Queenstown, apartment, open-plan, parking, investment opportunity", "output": "Investment-ready 2-bedroom apartment in Queenstown with open-plan layout and secure parking—ideal for first-time buyers or investors."}
{"input": "3 bedrooms, 2 bathrooms, Bethlehem, modern kitchen, braai area, double garage, large stand", "output": "Spacious 3-bedroom home in Bethlehem with a stylish kitchen, outdoor braai area, and large stand with double garage."}
{"input": "1 bedroom, 1 bathroom, Jeffreys Bay, apartment, beach access, security gate, tiled floors", "output": "Beachside living in Jeffreys Bay! 1-bedroom apartment just steps from the beach, with tiled interiors and secure access."}
{"input": "2 bedrooms, 1 bathroom, Welkom, flat, lock-up garage, communal garden, low levies", "output": "This affordable 2-bedroom flat in Welkom features a lock-up garage, well-maintained communal garden, and low monthly levies."}
{"input": "4 bedrooms, 3 bathrooms, Knysna, log cabin, lagoon views, double volume, wooden deck", "output": "Unique 4-bedroom log cabin in Knysna with double volume living, lagoon views, and a large wooden deck for sunset relaxation."}
{"input": "3 bedrooms, 2 bathrooms, Pretoria East, cluster home, solar panels, modern kitchen, study", "output": "Sustainable 3-bedroom cluster home in Pretoria East with solar panels, a sleek modern kitchen, and a private study for remote work."}
{"input": "2 bedrooms, 1 bathroom, Port Alfred, cottage, garden, sea view patio, single garage", "output": "Charming 2-bedroom cottage in Port Alfred with a sea view patio, single garage, and tranquil garden—ideal coastal escape."}
{"input": "3 bedrooms, 2.5 bathrooms, Johannesburg South, duplex, garage, private garden, balcony", "output": "Modern 3-bedroom duplex in Johannesburg South offering a private garden, balcony, and secure garage in a well-managed complex."}
{"input": "2 bedrooms, 1 bathroom, Newcastle, apartment, covered parking, tiled living area, gated complex", "output": "Well-maintained 2-bedroom apartment in Newcastle with tiled living area, covered parking, and 24-hour security in a gated complex."}
{"input": "4 bedrooms, 3 bathrooms, Langebaan, modern coastal home, enclosed braai area, ocean glimpses", "output": "A modern 4-bedroom coastal home in Langebaan with enclosed braai area, open-plan design, and beautiful ocean glimpses from the upper level."}
{"input": "3 bedrooms, 2 bathrooms, Polokwane, townhouse, double garage, solar geyser, private garden", "output": "Modern 3-bedroom townhouse in Polokwane featuring a private garden, solar geyser, and a spacious double garage in a secure complex."}
{"input": "2 bedrooms, 1 bathroom, Beaufort West, apartment, carport, tiled floors, quiet street", "output": "Affordable 2-bedroom apartment in Beaufort West with tiled floors, a carport, and peaceful location ideal for first-time buyers or retirees."}
{"input": "4 bedrooms, 3 bathrooms, Middelburg, freestanding home, entertainment area, fireplace, double garage", "output": "Spacious 4-bedroom home in Middelburg with a cozy fireplace, entertainment area, and double garage on a large stand—perfect for family living."}
{"input": "3 bedrooms, 2 bathrooms, Knysna, eco-estate, nature views, solar-ready, modern kitchen", "output": "This 3-bedroom home in Knysna's eco-estate features nature views, a modern kitchen, and solar-ready infrastructure for sustainable living."}
{"input": "2 bedrooms, 1 bathroom, Pretoria North, ground floor flat, garden access, pet-friendly, undercover parking", "output": "Pet-friendly ground-floor flat in Pretoria North with garden access, undercover parking, and two neat bedrooms in a secure complex."}
{"input": "5 bedrooms, 4.5 bathrooms, Stellenbosch, winelands estate, pool, gourmet kitchen, wine cellar", "output": "Ultimate luxury in Stellenbosch! This 5-bedroom estate home features a gourmet kitchen, private wine cellar, pool, and expansive winelands views."}
{"input": "3 bedrooms, 1.5 bathrooms, Port Elizabeth, face brick house, paved yard, carport, garden", "output": "Low-maintenance 3-bedroom face brick home in Port Elizabeth with a paved yard, carport, and sunny garden for family enjoyment."}
{"input": "4 bedrooms, 3 bathrooms, East London, triple garage, garden, entertainment patio, spacious kitchen", "output": "Elegant 4-bedroom home in East London offering a spacious kitchen, triple garage, garden, and a large patio ideal for entertaining guests."}
{"input": "2 bedrooms, 1 bathroom, Harrismith, apartment, balcony, parking bay, compact layout", "output": "Neat and compact 2-bedroom apartment in Harrismith with a balcony and secure parking bay—ideal lock-up-and-go for young professionals."}
{"input": "3 bedrooms, 2 bathrooms, Vredenburg, family house, garage, fenced yard, garden space", "output": "Family-friendly 3-bedroom home in Vredenburg with a garage, fenced yard, and ample garden space in a quiet residential area."}
{"input": "1 bedroom, 1 bathroom, Bellville, apartment, near public transport, secure building, tiled floors", "output": "Affordable 1-bedroom apartment in Bellville near public transport. Tiled interior and located in a secure building—great for commuters."}
{"input": "2 bedrooms, 2 bathrooms, Centurion, apartment, loft style, private balcony, clubhouse access", "output": "Loft-style 2-bedroom apartment in Centurion with private balcony, 2 bathrooms, and access to a clubhouse and pool in a lifestyle estate."}
{"input": "3 bedrooms, 2 bathrooms, Worcester, family home, braai area, pool, garage", "output": "Well-kept 3-bedroom family home in Worcester featuring a braai area, sparkling pool, and single garage in a friendly neighborhood."}
{"input": "4 bedrooms, 3 bathrooms, Mossel Bay, coastal home, sea views, double garage, wooden deck", "output": "Live by the sea in this 4-bedroom Mossel Bay home with sweeping ocean views, double garage, and a large wooden deck for entertaining."}
{"input": "2 bedrooms, 1 bathroom, Queenstown, apartment, fitted kitchen, secure complex, investment unit", "output": "Neat 2-bedroom apartment in Queenstown with a fitted kitchen and secure complex access—perfect investment opportunity or first-time home."}
{"input": "3 bedrooms, 2 bathrooms, Brakpan, cluster home, double carport, tiled floors, low levies", "output": "This 3-bedroom cluster home in Brakpan offers tiled floors, a double carport, and low levies in a peaceful development."}
{"input": "1 bedroom, 1 bathroom, Umhlanga, luxury apartment, ocean views, basement parking, secure access", "output": "Luxury 1-bedroom apartment in Umhlanga with ocean views, basement parking, and top-tier security in an exclusive seaside complex."}
{"input": "2 bedrooms, 1 bathroom, Bloemfontein, townhouse, garden, garage, quiet suburb", "output": "This 2-bedroom townhouse in Bloemfontein features a private garden, secure garage, and is located in a peaceful, family-friendly suburb."}
{"input": "4 bedrooms, 2.5 bathrooms, Klerksdorp, family house, study, entertainment room, pool", "output": "Spacious 4-bedroom family house in Klerksdorp offering a study, entertainment room, and pool—ideal for families needing space and comfort."}
{"input": "2 bedrooms, 1 bathroom, Stellenbosch, apartment, student friendly, walking distance to shops, secure block", "output": "Student-friendly 2-bedroom apartment in Stellenbosch located within walking distance of shops and campus, set in a secure block."}
{"input": "3 bedrooms, 2 bathrooms, Cape Town, apartment, sea view, balcony, secure complex", "output": "Modern 3-bedroom apartment in Cape Town offering stunning sea views from a private balcony, situated in a secure complex with 24-hour security."}
{"input": "4 bedrooms, 3 bathrooms, Johannesburg, house, double garage, garden, swimming pool", "output": "Spacious 4-bedroom house in Johannesburg featuring a lush garden, sparkling swimming pool, and a double garage for secure parking."}
{"input": "2 bedrooms, 1 bathroom, Durban, townhouse, pet-friendly, private garden, close to schools", "output": "Charming 2-bedroom pet-friendly townhouse in Durban with a private garden, conveniently located near reputable schools."}
{"input": "5 bedrooms, 4 bathrooms, Pretoria, estate home, golf course access, modern kitchen, study", "output": "Luxurious 5-bedroom estate home in Pretoria with direct golf course access, a state-of-the-art kitchen, and a private study."}
{"input": "1 bedroom, 1 bathroom, Sandton, apartment, furnished, rooftop pool, gym access", "output": "Stylish furnished 1-bedroom apartment in Sandton featuring access to a rooftop pool and fully-equipped gym."}
{"input": "3 bedrooms, 2 bathrooms, Port Elizabeth, duplex, ocean view, open-plan living, secure parking", "output": "Contemporary 3-bedroom duplex in Port Elizabeth boasting ocean views, open-plan living spaces, and secure parking."}
{"input": "4 bedrooms, 2.5 bathrooms, Bloemfontein, family home, large yard, entertainment area, double garage", "output": "Family-friendly 4-bedroom home in Bloemfontein with a spacious yard, dedicated entertainment area, and double garage."}
{"input": "2 bedrooms, 1 bathroom, Stellenbosch, apartment, student accommodation, walking distance to university, secure complex", "output": "Ideal student accommodation: 2-bedroom apartment in Stellenbosch within walking distance to the university, located in a secure complex."}
{"input": "3 bedrooms, 2 bathrooms, East London, townhouse, lock-up-and-go, low maintenance, modern finishes", "output": "Modern 3-bedroom lock-up-and-go townhouse in East London featuring low maintenance living and contemporary finishes."}
{"input": "5 bedrooms, 3 bathrooms, Nelspruit, house, mountain views, landscaped garden, pool", "output": "Elegant 5-bedroom house in Nelspruit offering breathtaking mountain views, a landscaped garden, and a refreshing pool."}
{"input": "3 bedrooms, 2 bathrooms, Gqeberha, townhouse, garden, garage, close to schools", "output": "Well-maintained 3-bedroom townhouse in Gqeberha with 2 bathrooms, a private garden, and garage—perfectly located near local schools."}
{"input": "2 bedrooms, 1 bathroom, Vereeniging, apartment, lock-up garage, tiled floors, near CBD", "output": "Secure 2-bedroom apartment in Vereeniging with a lock-up garage, tiled floors, and excellent access to the CBD and public transport."}
{"input": "4 bedrooms, 3 bathrooms, Richards Bay, family home, entertainment area, swimming pool, garden", "output": "This spacious 4-bedroom family home in Richards Bay offers 3 bathrooms, an entertainment patio, a swimming pool, and a landscaped garden."}
{"input": "1 bedroom, 1 bathroom, Stellenbosch, bachelor flat, secure block, walking distance to campus", "output": "Modern bachelor flat in Stellenbosch within walking distance to campus, set in a secure block—ideal for students or young professionals."}
{"input": "5 bedrooms, 4 bathrooms, Pretoria East, double-storey home, solar system, pool, staff quarters", "output": "Luxury double-storey 5-bedroom home in Pretoria East featuring a solar system, pool, staff accommodation, and premium finishes."}
{"input": "2 bedrooms, 1 bathroom, East London, apartment, balcony, sea breeze, gated complex", "output": "Neat 2-bedroom apartment in East London with a private balcony, fresh sea breeze, and set in a gated, secure complex."}
{"input": "4 bedrooms, 2.5 bathrooms, Randburg, freestanding home, entertainment deck, double garage, garden", "output": "Modern 4-bedroom freestanding home in Randburg featuring an entertainment deck, double garage, and a lush garden for family living."}
{"input": "3 bedrooms, 2 bathrooms, George, townhouse, mountain views, open-plan, lock-up garage", "output": "Stunning 3-bedroom townhouse in George with mountain views, open-plan living area, and a lock-up garage for secure parking."}
{"input": "2 bedrooms, 1 bathroom, Polokwane, apartment, secure complex, tiled interior, carport", "output": "Low-maintenance 2-bedroom apartment in Polokwane with tiled interiors, a carport, and excellent security in a gated complex."}
{"input": "4 bedrooms, 3 bathrooms, Mossel Bay, coastal villa, sea views, modern finishes, double garage", "output": "This elegant 4-bedroom coastal villa in Mossel Bay offers sea views, luxury finishes, and a double garage in a prime seaside setting."}
{"input": "3 bedrooms, 2 bathrooms, Soweto, house, paved yard, carport, burglar bars", "output": "Secure 3-bedroom home in Soweto with 2 bathrooms, a paved yard, carport, and full burglar bars for peace of mind."}
{"input": "2 bedrooms, 1 bathroom, Queenstown, townhouse, pet-friendly, small garden, garage", "output": "Pet-friendly 2-bedroom townhouse in Queenstown featuring a small garden and secure garage, perfect for small families."}
{"input": "5 bedrooms, 3.5 bathrooms, Durban North, luxury home, pool, garden, entertainment area", "output": "Impressive 5-bedroom luxury home in Durban North with 3.5 bathrooms, a pool, landscaped garden, and stunning entertainment space."}
{"input": "3 bedrooms, 1.5 bathrooms, Springs, cluster home, tiled floors, small yard, garage", "output": "Tidy 3-bedroom cluster home in Springs with tiled interiors, a compact private yard, and single garage in a peaceful area."}
{"input": "4 bedrooms, 2 bathrooms, Paarl, house, mountain views, garden, carport", "output": "Charming 4-bedroom home in Paarl offering mountain views, a spacious garden, and a convenient carport for family use."}
{"input": "2 bedrooms, 2 bathrooms, Bellville, apartment, modern kitchen, balcony, covered parking", "output": "Stylish 2-bedroom apartment in Bellville with a modern kitchen, balcony, and secure covered parking in a quiet complex."}
{"input": "3 bedrooms, 2 bathrooms, Upington, house, water tank, fenced yard, double carport", "output": "Comfortable 3-bedroom home in Upington featuring a double carport, fenced yard, and water tank—ideal for arid climates."}
{"input": "2 bedrooms, 1 bathroom, Vanderbijlpark, apartment, near university, parking bay, tiled", "output": "Neat 2-bedroom apartment in Vanderbijlpark with tiled floors, a designated parking bay, and close to the local university."}
{"input": "4 bedrooms, 3 bathrooms, Knysna, log home, lagoon views, large deck, fireplace", "output": "Unique 4-bedroom log home in Knysna with expansive lagoon views, a large wooden deck, and cozy fireplace—perfect for holiday living."}
{"input": "3 bedrooms, 2 bathrooms, Brits, house, open-plan kitchen, double garage, secure fencing", "output": "Spacious 3-bedroom house in Brits with an open-plan kitchen, double garage, and secure fencing—ideal for families and pets."}
{"input": "2 bedrooms, 1 bathroom, Kathu, apartment, aircon, balcony, undercover parking", "output": "Air-conditioned 2-bedroom apartment in Kathu with a private balcony and secure undercover parking—ideal for lock-up-and-go living."}
{"input": "3 bedrooms, 2 bathrooms, Oudtshoorn, freestanding house, carport, garden, tiled floors", "output": "Neat 3-bedroom freestanding house in Oudtshoorn featuring a carport, tiled floors, and a well-kept garden for outdoor enjoyment."}
{"input": "4 bedrooms, 2.5 bathrooms, Jeffreys Bay, beach house, sea views, double garage, braai area", "output": "Enjoy coastal living in this 4-bedroom beach house in Jeffreys Bay with sea views, a double garage, and an outdoor braai area."}
{"input": "1 bedroom, 1 bathroom, Pretoria Central, flat, secure access, lift, parking bay", "output": "Affordable 1-bedroom flat in Pretoria Central with secure access, a lift, and designated parking bay—ideal for city commuters."}
{"input": "2 bedrooms, 1 bathroom, Beaufort West, townhouse, garage, garden, open-plan layout", "output": "Spacious 2-bedroom townhouse in Beaufort West offering a private garden, garage, and an open-plan kitchen and lounge area."}
{"input": "3 bedrooms, 2 bathrooms, Bloemfontein, cluster home, double garage, modern finishes, safe area", "output": "Contemporary 3-bedroom cluster home in Bloemfontein with a double garage, modern finishes, and located in a quiet, secure suburb."}
{"input": "4 bedrooms, 3 bathrooms, Hout Bay, luxury villa, mountain views, infinity pool, gourmet kitchen", "output": "Breathtaking 4-bedroom villa in Hout Bay with mountain views, an infinity pool, and a gourmet kitchen—perfect for entertaining in style."}
{"input": "2 bedrooms, 1 bathroom, Tzaneen, flat, low maintenance, parking, secure block", "output": "Low-maintenance 2-bedroom flat in Tzaneen with secure parking, tiled interior, and set in a peaceful, well-managed block."}
{"input": "5 bedrooms, 3 bathrooms, Polokwane, double-storey house, garden, garage, domestic quarters", "output": "Expansive 5-bedroom double-storey house in Polokwane with a landscaped garden, domestic quarters, and spacious garage."}
{"input": "3 bedrooms, 2 bathrooms, Centurion, townhouse, pet-friendly, double garage, private garden", "output": "Pet-friendly 3-bedroom townhouse in Centurion featuring a private garden, double garage, and excellent location near amenities."}
{"input": "2 bedrooms, 1 bathroom, Grahamstown, student flat, walking distance to university, furnished", "output": "Furnished 2-bedroom student flat in Grahamstown just a short walk from the university—ideal investment property."}
{"input": "4 bedrooms, 2 bathrooms, Kimberley, house, borehole, carport, secure yard", "output": "Sturdy 4-bedroom house in Kimberley with a borehole, secure yard, and spacious carport for multiple vehicles."}
{"input": "3 bedrooms, 2 bathrooms, Durbanville, duplex, balcony, open-plan, garage", "output": "Modern 3-bedroom duplex in Durbanville with an open-plan layout, upstairs balcony, and single garage in a quiet estate."}
{"input": "2 bedrooms, 1 bathroom, Witbank, flat, tiled floors, carport, close to shopping centre", "output": "Convenient 2-bedroom flat in Witbank with tiled floors, secure carport, and within walking distance to the local shopping centre."}
{"input": "4 bedrooms, 3 bathrooms, Paarl, estate home, vineyard views, braai room, garage", "output": "Elegant 4-bedroom home in a secure Paarl estate with vineyard views, indoor braai room, and spacious garage—ideal for entertaining."}
{"input": "1 bedroom, 1 bathroom, Bellville, retirement unit, ground floor, garden access, safe complex", "output": "Ground floor 1-bedroom retirement unit in Bellville with garden access and 24/7 security—perfect for peaceful senior living."}
{"input": "3 bedrooms, 2.5 bathrooms, Margate, townhouse, sea views, patio, lock-up garage", "output": "Stylish 3-bedroom townhouse in Margate with sea views, a relaxing patio, and a lock-up garage in a secure coastal complex."}
{"input": "2 bedrooms, 2 bathrooms, Hermanus, apartment, modern kitchen, sea view balcony, covered parking", "output": "Upmarket 2-bedroom apartment in Hermanus with a sea view balcony, modern kitchen, and covered parking in a sought-after location."}
{"input": "5 bedrooms, 4 bathrooms, Waterkloof, luxury home, pool, cinema room, triple garage", "output": "Exquisite 5-bedroom luxury home in Waterkloof featuring a pool, private cinema, triple garage, and high-end designer finishes."}
{"input": "3 bedrooms, 2 bathrooms, Secunda, freestanding house, kitchen island, braai area, double garage", "output": "Family-friendly 3-bedroom home in Secunda with a modern kitchen island, outdoor braai area, and a spacious double garage."}
{"input": "2 bedrooms, 1 bathroom, Malmesbury, flat, secure complex, open-plan kitchen, balcony", "output": "This neat 2-bedroom flat in Malmesbury features an open-plan kitchen, balcony, and is set in a secure, well-managed complex."}
{"input": "3 bedrooms, 2 bathrooms, Boksburg, house, pool, double garage, entertainment patio", "output": "Spacious 3-bedroom house in Boksburg with a sparkling pool, double garage, and an entertainment patio perfect for gatherings."}
{"input": "4 bedrooms, 3.5 bathrooms, Somerset West, estate home, mountain views, home office, triple garage", "output": "Elegant 4-bedroom estate home in Somerset West with mountain views, a home office, triple garage, and refined living spaces."}
{"input": "2 bedrooms, 2 bathrooms, Newcastle, apartment, modern kitchen, tiled floors, parking bay", "output": "Modern 2-bedroom apartment in Newcastle with sleek tiled floors, a stylish kitchen, and an allocated parking bay in a secure block."}
{"input": "5 bedrooms, 4 bathrooms, Ballito, coastal home, ocean views, entertainment area, garden", "output": "Impressive 5-bedroom coastal home in Ballito boasting ocean views, a large entertainment space, and a manicured garden."}
{"input": "1 bedroom, 1 bathroom, Rustenburg, studio, student accommodation, furnished, walking distance to college", "output": "Furnished 1-bedroom studio in Rustenburg ideal for students, within walking distance to college and set in a secure environment."}
{"input": "3 bedrooms, 2 bathrooms, Vanderbijlpark, duplex, secure complex, lock-up garage, garden", "output": "Lovely 3-bedroom duplex in Vanderbijlpark with a lock-up garage, small garden, and situated in a secure, family-friendly complex."}
{"input": "4 bedrooms, 2 bathrooms, Uitenhage, freestanding house, borehole, large stand, carport", "output": "Sturdy 4-bedroom freestanding house in Uitenhage on a large stand with a borehole, carport, and ample outdoor space."}
{"input": "2 bedrooms, 1 bathroom, Klerksdorp, townhouse, carport, compact garden, pet-friendly", "output": "Pet-friendly 2-bedroom townhouse in Klerksdorp featuring a compact private garden and secure carport in a quiet suburb."}
{"input": "3 bedrooms, 2.5 bathrooms, Edenvale, cluster home, modern design, open-plan kitchen, garage", "output": "Contemporary 3-bedroom cluster home in Edenvale with open-plan living, modern finishes, and a secure lock-up garage."}
{"input": "4 bedrooms, 3 bathrooms, Secunda, house, study, garden, double garage, braai area", "output": "Large 4-bedroom home in Secunda featuring a study, garden, double garage, and built-in braai area for entertaining."}
{"input": "2 bedrooms, 1 bathroom, Mossel Bay, apartment, sea views, balcony, parking bay", "output": "Cozy 2-bedroom apartment in Mossel Bay with sea views from the balcony and an allocated parking bay in a secure coastal block."}
{"input": "3 bedrooms, 2 bathrooms, Middelburg, townhouse, double garage, secure complex, patio", "output": "Secure 3-bedroom townhouse in Middelburg with a double garage, private patio, and access-controlled entry."}
{"input": "5 bedrooms, 3 bathrooms, Cape Town, luxury home, pool, rooftop terrace, mountain backdrop", "output": "Luxurious 5-bedroom home in Cape Town with a rooftop terrace, pool, and stunning mountain backdrop views—perfect for entertainers."}
{"input": "2 bedrooms, 1 bathroom, Vanderbijlpark, apartment, modern layout, tiled floors, secure parking", "output": "Modern 2-bedroom apartment in Vanderbijlpark featuring tiled floors, a sleek layout, and secure off-street parking."}
{"input": "4 bedrooms, 2 bathrooms, Soweto, house, paved yard, secure fencing, double carport", "output": "Affordable 4-bedroom house in Soweto with a paved yard, secure fencing, and double carport in a peaceful neighborhood."}
{"input": "1 bedroom, 1 bathroom, Umhlanga, apartment, sea views, high-rise, 24-hour security", "output": "Chic 1-bedroom apartment in Umhlanga’s high-rise tower with sea views and round-the-clock security—ideal for young professionals."}
{"input": "3 bedrooms, 2 bathrooms, Johannesburg South, house, garage, large yard, tiled floors", "output": "Comfortable 3-bedroom house in Johannesburg South with tiled flooring, a large fenced yard, and a secure garage."}
{"input": "2 bedrooms, 1 bathroom, Paarl, cottage, garden, mountain views, parking", "output": "Charming 2-bedroom cottage in Paarl with a lovely garden, scenic mountain views, and secure parking on site."}
{"input": "4 bedrooms, 3 bathrooms, East London, townhouse, lock-up garage, pool, garden", "output": "Spacious 4-bedroom townhouse in East London with a private garden, pool, and lock-up garage in a secure complex."}
{"input": "3 bedrooms, 2 bathrooms, Rustenburg, house, double garage, garden, open-plan kitchen", "output": "Spacious 3-bedroom house in Rustenburg with a double garage, lush garden, and an open-plan kitchen ideal for family living."}
{"input": "2 bedrooms, 1 bathroom, Nelspruit, apartment, balcony, tiled floors, close to shops", "output": "Modern 2-bedroom apartment in Nelspruit with a private balcony, tiled floors, and close proximity to shops and amenities."}
{"input": "4 bedrooms, 3 bathrooms, Pretoria North, house, double storey, pool, entertainment area", "output": "This double-storey 4-bedroom home in Pretoria North features a swimming pool, entertainment area, and ample space for the whole family."}
{"input": "1 bedroom, 1 bathroom, George, flat, student-friendly, compact kitchen, parking bay", "output": "Student-friendly 1-bedroom flat in George with a compact kitchen, parking bay, and walking distance to campus facilities."}
{"input": "3 bedrooms, 2 bathrooms, Bethlehem, townhouse, secure complex, garden, garage", "output": "Comfortable 3-bedroom townhouse in Bethlehem with a private garden, single garage, and secure access in a peaceful complex."}
{"input": "2 bedrooms, 2 bathrooms, Bloemfontein, apartment, granite tops, balcony, carport", "output": "Upmarket 2-bedroom apartment in Bloemfontein featuring granite kitchen tops, a balcony, and a secure covered carport."}
{"input": "5 bedrooms, 3 bathrooms, Gansbaai, coastal house, sea views, fireplace, garden", "output": "Coastal 5-bedroom home in Gansbaai with stunning sea views, a cozy fireplace, and a garden ideal for seaside living."}
{"input": "4 bedrooms, 2 bathrooms, Thohoyandou, house, tiled floors, garage, large yard", "output": "Affordable 4-bedroom house in Thohoyandou with tiled interiors, a large fenced yard, and secure garage for multiple cars."}
{"input": "2 bedrooms, 1 bathroom, Durban CBD, flat, lift access, 24-hour security, parking bay", "output": "Neat 2-bedroom flat in Durban CBD with lift access, 24-hour security, and a designated parking bay in a secure complex."}
{"input": "3 bedrooms, 2 bathrooms, Randburg, apartment, ground floor, pet-friendly, private garden", "output": "Ground-floor 3-bedroom apartment in Randburg that's pet-friendly and features a private garden and open-plan layout."}
{"input": "4 bedrooms, 3.5 bathrooms, Cape Town City Bowl, penthouse, panoramic views, designer kitchen", "output": "Luxury 4-bedroom penthouse in Cape Town's City Bowl with panoramic views, a designer kitchen, and premium finishes throughout."}
{"input": "2 bedrooms, 1 bathroom, Welkom, townhouse, lock-up garage, fenced yard, patio", "output": "Secure 2-bedroom townhouse in Welkom with a lock-up garage, fenced yard, and cozy patio space for relaxing or entertaining."}
{"input": "3 bedrooms, 1.5 bathrooms, Springs, house, paved yard, garden, garage", "output": "Affordable 3-bedroom house in Springs with a paved yard, well-maintained garden, and a single garage for secure parking."}
{"input": "2 bedrooms, 2 bathrooms, Langebaan, apartment, lagoon views, balcony, secure parking", "output": "Stylish 2-bedroom apartment in Langebaan offering beautiful lagoon views from the balcony and secure parking in a gated block."}
{"input": "5 bedrooms, 4 bathrooms, Pretoria East, mansion, pool, cinema room, triple garage", "output": "Lavish 5-bedroom mansion in Pretoria East with a swimming pool, home cinema, and a triple garage in an elite neighborhood."}
{"input": "3 bedrooms, 2 bathrooms, Knysna, duplex, forest views, open-plan living, deck", "output": "Charming 3-bedroom duplex in Knysna with forest views, open-plan living area, and a scenic wooden deck for outdoor relaxation."}
{"input": "2 bedrooms, 1 bathroom, Kimberley, apartment, near university, tiled, carport", "output": "Convenient 2-bedroom apartment in Kimberley with tiled floors, a carport, and walking distance to the local university campus."}
{"input": "4 bedrooms, 2 bathrooms, Tzaneen, house, double carport, garden, fenced yard", "output": "Spacious 4-bedroom house in Tzaneen with a double carport, well-maintained garden, and fenced yard—ideal for families."}
{"input": "1 bedroom, 1 bathroom, Ballito, studio, modern finishes, walking distance to beach, secure block", "output": "Modern studio apartment in Ballito just steps from the beach, featuring sleek finishes and 24-hour security in a trendy block."}
{"input": "3 bedrooms, 2 bathrooms, Kraaifontein, house, enclosed yard, tiled floors, garage", "output": "Well-kept 3-bedroom house in Kraaifontein with an enclosed yard, garage, and low-maintenance tiled flooring throughout."}
{"input": "2 bedrooms, 1 bathroom, Umtata, apartment, secure block, near university, covered parking", "output": "Secure 2-bedroom apartment in Umtata, conveniently located near the university with covered parking and 24-hour access control."}
{"input": "3 bedrooms, 2 bathrooms, Middelburg, house, tiled floors, carport, large yard", "output": "Spacious 3-bedroom house in Middelburg with tiled floors throughout, a large yard, and a secure carport for two vehicles."}
{"input": "4 bedrooms, 3 bathrooms, Port Shepstone, family home, sea views, entertainment patio, double garage", "output": "This 4-bedroom family home in Port Shepstone boasts sea views, an entertainment patio, and a double garage in a prime location."}
{"input": "1 bedroom, 1 bathroom, Polokwane, flat, furnished, near CBD, secure block", "output": "Furnished 1-bedroom flat in Polokwane, close to the CBD and set in a secure, well-maintained block—ideal for professionals."}
{"input": "5 bedrooms, 4 bathrooms, Cape St Francis, beachfront house, modern finishes, garden, garage", "output": "Stunning 5-bedroom beachfront home in Cape St Francis with modern finishes, private garden, and secure garage."}
{"input": "2 bedrooms, 1 bathroom, Pretoria West, townhouse, garage, fenced garden, near transport", "output": "Affordable 2-bedroom townhouse in Pretoria West with a fenced garden, garage, and located close to public transport routes."}
{"input": "3 bedrooms, 2 bathrooms, Richards Bay, apartment, balcony, modern kitchen, undercover parking", "output": "Modern 3-bedroom apartment in Richards Bay with a balcony, stylish kitchen, and undercover parking in a secure complex."}
{"input": "4 bedrooms, 3 bathrooms, Kimberley, house, lounge, dining room, double garage, garden", "output": "Spacious 4-bedroom house in Kimberley featuring a large lounge, dining room, garden, and a secure double garage."}
{"input": "2 bedrooms, 1 bathroom, Worcester, flat, neat interior, secure complex, carport", "output": "Neat 2-bedroom flat in Worcester with a tidy interior, carport, and security features in a gated complex."}
{"input": "3 bedrooms, 1.5 bathrooms, Sasolburg, house, garage, open-plan living, large stand", "output": "This 3-bedroom house in Sasolburg offers an open-plan living space, large stand, and a secure garage—ideal for families."}
{"input": "1 bedroom, 1 bathroom, Randburg, bachelor flat, furnished, parking, central location", "output": "Furnished bachelor flat in Randburg with secure parking, modern finishes, and a central location close to all amenities."}
{"input": "2 bedrooms, 2 bathrooms, Durban North, apartment, modern design, balcony, secure parking", "output": "Stylish 2-bedroom apartment in Durban North with modern design elements, a balcony, and secure off-street parking."}
{"input": "4 bedrooms, 2 bathrooms, Vanderbijlpark, family home, paved yard, pool, carport", "output": "Family-oriented 4-bedroom home in Vanderbijlpark featuring a paved yard, pool, and spacious carport."}
{"input": "3 bedrooms, 2 bathrooms, Hartbeespoort, townhouse, views, open-plan kitchen, patio", "output": "Lovely 3-bedroom townhouse in Hartbeespoort with open-plan kitchen, a relaxing patio, and scenic views of the area."}
{"input": "5 bedrooms, 3 bathrooms, Pretoria East, modern home, pool, staff quarters, triple garage", "output": "Contemporary 5-bedroom home in Pretoria East with a private pool, staff quarters, and a spacious triple garage."}
{"input": "2 bedrooms, 1 bathroom, Witbank, flat, lock-up garage, low maintenance, tiled floors", "output": "Low-maintenance 2-bedroom flat in Witbank with tiled flooring, a lock-up garage, and located in a quiet complex."}
{"input": "3 bedrooms, 2 bathrooms, Mossel Bay, duplex, secure estate, ocean views, garage", "output": "Coastal 3-bedroom duplex in Mossel Bay within a secure estate, offering ocean views and a private garage."}
{"input": "4 bedrooms, 3 bathrooms, Paarl, house, pool, mountain views, outdoor braai area", "output": "Beautiful 4-bedroom house in Paarl with mountain views, pool, and a dedicated outdoor braai area for entertaining."}
{"input": "2 bedrooms, 1 bathroom, Pietermaritzburg, apartment, tiled, balcony, secure complex", "output": "Tidy 2-bedroom apartment in Pietermaritzburg with tiled floors, balcony, and set in a secure and well-maintained complex."}
{"input": "3 bedrooms, 2 bathrooms, Vredenburg, townhouse, garage, garden, close to schools", "output": "Family-friendly 3-bedroom townhouse in Vredenburg with a garden, garage, and located close to schools and shops."}
{"input": "vacant land, 500 sqm, Bloemfontein, residential stand, level ground, fenced, serviced", "output": "Vacant 500 sqm residential stand in Bloemfontein with level ground, perimeter fencing, and full municipal services—ready to build."}
{"input": "commercial property, 300 sqm, Cape Town CBD, office block, reception, boardroom, parking", "output": "Prime 300 sqm commercial office space in Cape Town CBD featuring a reception area, boardroom, multiple offices, and secure parking."}
{"input": "retirement home, 2 bedrooms, 1 bathroom, Port Elizabeth, ground floor, nursing services, garden access", "output": "Comfortable 2-bedroom retirement home in Port Elizabeth with garden access, ground floor convenience, and available nursing care."}
{"input": "student accommodation, 10 rooms, 4 bathrooms, Pretoria, walking distance to university, communal kitchen", "output": "Fully let student house in Pretoria with 10 rooms, communal kitchen, and 4 shared bathrooms—excellent investment near university."}
{"input": "plot, 800 sqm, Langebaan, sea views, near beach, corner stand", "output": "Scenic 800 sqm plot in Langebaan offering sea views and located just minutes from the beach—ideal for your dream coastal home."}
{"input": "commercial retail unit, 120 sqm, Polokwane, shopfront, high foot traffic, alarm system", "output": "120 sqm retail unit in Polokwane with glass shopfront, excellent visibility, and alarm system—ideal for retail or takeaway."}
{"input": "investment property, 6 flats, East London, income-generating, fully occupied, secure gate", "output": "High-yield investment in East London: 6 fully let flats behind a secure gate, ideal for generating passive income."}
{"input": "vacant plot, 1000 sqm, Pretoria East, estate stand, north-facing, mountain views", "output": "Large 1000 sqm north-facing stand in Pretoria East estate with mountain views and estate security—perfect for custom building."}
{"input": "commercial building, 4 offices, 2 bathrooms, Kimberley, reception, parking, business zoning", "output": "Business-zoned commercial building in Kimberley featuring 4 private offices, a reception, and secure client parking."}
{"input": "student flat, 1 bedroom, Grahamstown, furnished, secure access, walking distance to campus", "output": "Furnished 1-bedroom student flat in Grahamstown with secure access and a short walk to Rhodes University—great for students or rentals."}
{"input": "warehouse, 500 sqm, Midrand, roller doors, high ceilings, office, 3-phase power", "output": "500 sqm industrial warehouse in Midrand with roller shutter doors, 3-phase power, and attached office space—ideal for logistics or storage."}
{"input": "vacant land, 600 sqm, Jeffreys Bay, residential zoning, sea-facing, elevated stand", "output": "Elevated 600 sqm sea-facing stand in Jeffreys Bay, zoned for residential use—ideal for building your dream holiday home."}
{"input": "commercial unit, 250 sqm, Durban, warehouse/shop combo, front and rear access, high traffic zone", "output": "Versatile 250 sqm commercial unit in Durban combining warehouse and retail space with access from both ends—high visibility guaranteed."}
{"input": "retirement unit, 1 bedroom, 1 bathroom, Knysna, kitchenette, medical support, community center", "output": "Secure 1-bedroom retirement unit in Knysna with kitchenette, access to medical support, and an active community center."}
{"input": "plot, 1200 sqm, Nelspruit, development land, near schools, water & electricity available", "output": "Spacious 1200 sqm development plot in Nelspruit near schools and fully serviced—ideal for family home or small development."}
{"input": "student building, 15 rooms, Mowbray, Cape Town, shared bathrooms, Wi-Fi, courtyard", "output": "Profitable 15-room student residence in Mowbray with shared facilities, uncapped Wi-Fi, and a sunny central courtyard."}
{"input": "industrial land, 2000 sqm, Alberton, zoned for manufacturing, flat terrain, easy truck access", "output": "Prime 2000 sqm industrial land in Alberton, zoned for manufacturing, offering easy truck access and flat build-ready terrain."}
{"input": "investment flat, 2 bedrooms, Bloemfontein, fully tenanted, low levies, great ROI", "output": "Income-generating 2-bedroom flat in Bloemfontein with long-term tenants in place and low monthly levies—great ROI potential."}
{"input": "vacant plot, 500 sqm, Stilbaai, coastal village, quiet street, sea breeze", "output": "Tranquil 500 sqm plot in Stilbaai coastal village on a quiet street—just a short walk from the beach, ready for your dream home."}
{"input": "retail space, 85 sqm, Bellville, busy street, display windows, prepaid electricity", "output": "Compact 85 sqm retail unit in Bellville with prominent window frontage, prepaid electricity, and strong daily foot traffic."}
{"input": "luxury home, 6 bedrooms, 6 bathrooms, Clifton, Cape Town, ocean views, pool, elevator, wine cellar", "output": "Prestigious 6-bedroom mansion in Clifton with panoramic ocean views, private elevator, wine cellar, and a stunning infinity pool."}
{"input": "farm, 10 hectares, Oudtshoorn, irrigation system, borehole, farmhouse, outbuildings", "output": "Expansive 10-hectare farm in Oudtshoorn with a main farmhouse, borehole, irrigation system, and multiple outbuildings."}
{"input": "industrial warehouse, 1500 sqm, Germiston, roller doors, 3-phase power, truck access", "output": "Spacious 1500 sqm industrial warehouse in Germiston with high clearance, 3-phase power, and large roller doors for truck entry."}
{"input": "luxury penthouse, 3 bedrooms, 3.5 bathrooms, Umhlanga, sea views, rooftop deck, private lift", "output": "Elegant 3-bedroom penthouse in Umhlanga with sweeping sea views, a private rooftop deck, and direct lift access."}
{"input": "farm, 50 hectares, Bela-Bela, cattle facilities, dam, worker housing, solar", "output": "Versatile 50-hectare farm in Bela-Bela with cattle handling facilities, dam, solar-powered systems, and worker accommodation."}
{"input": "industrial park unit, 600 sqm, Bloemfontein, office space, roller shutters, mezzanine floor", "output": "Secure 600 sqm industrial unit in Bloemfontein with mezzanine office space, roller shutters, and ample onsite parking."}
{"input": "luxury villa, 5 bedrooms, 4 bathrooms, Constantia, wine cellar, garden, pool, smart home system", "output": "Stunning 5-bedroom luxury villa in Constantia featuring a wine cellar, landscaped garden, heated pool, and smart home automation."}
{"input": "game farm, 200 hectares, Limpopo, lodge, waterholes, fencing, wildlife included", "output": "Fully operational 200-hectare game farm in Limpopo with luxury lodge, fenced perimeters, waterholes, and included wildlife stock."}
{"input": "factory, 2200 sqm, Port Elizabeth, high ceilings, loading bays, offices, secure fencing", "output": "Large 2200 sqm factory in Port Elizabeth with high ceilings, multiple loading bays, offices, and secure perimeter fencing."}
{"input": "luxury estate home, 4 bedrooms, 3.5 bathrooms, Midstream Estate, triple garage, pool, staff quarters", "output": "Elegant 4-bedroom home in Midstream Estate with a triple garage, staff quarters, entertainment patio, and heated pool."}
{"input": "farm, 15 hectares, Howick, arable land, barns, farmhouse, stream frontage", "output": "Beautiful 15-hectare farm in Howick offering fertile land, barns, a traditional farmhouse, and stream frontage."}
{"input": "industrial unit, 900 sqm, East London, warehouse with office, security gate, ablution facilities", "output": "Well-maintained 900 sqm warehouse in East London with attached offices, secure gate access, and staff ablution facilities."}
{"input": "luxury home, 5 bedrooms, 5.5 bathrooms, Bishopscourt, tennis court, landscaped garden, guest wing", "output": "Exquisite 5-bedroom luxury residence in Bishopscourt with a private tennis court, guest wing, and manicured gardens."}
{"input": "farm, 30 hectares, Paarl, vineyards, farmhouse, cellar, tractor included", "output": "Prime 30-hectare vineyard farm in Paarl with a traditional farmhouse, working wine cellar, and farming equipment included."}
{"input": "industrial warehouse, 1800 sqm, Bellville, double volume, loading dock, air-conditioned office", "output": "Double-volume 1800 sqm warehouse in Bellville with loading dock, air-conditioned office suite, and secure access control."}
{"input": "luxury apartment, 2 bedrooms, 2 bathrooms, Sandton, concierge, rooftop pool, furnished", "output": "Fully furnished 2-bedroom luxury apartment in Sandton with concierge service and access to a rooftop pool and gym."}
{"input": "farm, 8 hectares, George, vegetable tunnels, cold room, irrigation system, tool sheds", "output": "Productive 8-hectare vegetable farm in George with tunnel infrastructure, cold room, irrigation setup, and tool sheds."}
{"input": "distribution centre, 3500 sqm, Johannesburg, multiple loading bays, offices, generator backup", "output": "Modern 3500 sqm distribution centre in Johannesburg with 5 loading bays, offices, and full generator backup system."}
{"input": "luxury beachfront home, 4 bedrooms, 3 bathrooms, Ballito, direct beach access, infinity pool, deck", "output": "Beachfront 4-bedroom home in Ballito with direct beach access, an infinity pool, entertainment deck, and private garden."}
{"input": "farm, 12 hectares, Stellenbosch, equestrian facilities, vineyard potential, borehole", "output": "Versatile 12-hectare property in Stellenbosch with equestrian infrastructure, vineyard potential, and reliable borehole water."}
{"input": "2 bedrooms, 1 bathroom, Kraaifontein, apartment, ground floor, pet-friendly, parking bay", "output": "Pet-friendly 2-bedroom ground-floor apartment in Kraaifontein with tiled flooring and an allocated parking bay in a secure complex."}
{"input": "3 bedrooms, 2 bathrooms, Durbanville, townhouse, double garage, garden, quiet suburb", "output": "Modern 3-bedroom townhouse in Durbanville with a double garage, spacious garden, and located in a quiet, family-friendly suburb."}
{"input": "4 bedrooms, 2.5 bathrooms, Potchefstroom, freestanding house, large yard, double carport", "output": "Spacious 4-bedroom freestanding house in Potchefstroom with a large yard, double carport, and multiple living areas."}
{"input": "1 bedroom, 1 bathroom, Grahamstown, student flat, secure entry, walking distance to university", "output": "Affordable 1-bedroom student flat in Grahamstown with secure entry and walking distance to Rhodes University."}
{"input": "5 bedrooms, 4 bathrooms, Johannesburg North, luxury home, pool, cinema room, triple garage", "output": "Exquisite 5-bedroom luxury home in Johannesburg North with a private cinema, pool, and triple garage in a sought-after area."}
{"input": "3 bedrooms, 2 bathrooms, Bloemfontein, cluster home, open-plan kitchen, double garage, garden", "output": "Contemporary 3-bedroom cluster home in Bloemfontein with a double garage, modern open-plan kitchen, and fenced garden."}
{"input": "2 bedrooms, 1 bathroom, Witbank, townhouse, tiled floors, lock-up garage, secure complex", "output": "Secure 2-bedroom townhouse in Witbank with tiled floors, a lock-up garage, and 24/7 security in a well-managed complex."}
{"input": "4 bedrooms, 3 bathrooms, Knysna, home, lagoon views, wrap-around deck, fireplace", "output": "Charming 4-bedroom home in Knysna with lagoon views, a cozy fireplace, and a wrap-around deck for relaxing and entertaining."}
{"input": "plot, 700 sqm, Upington, residential zoning, flat stand, ready to build", "output": "Flat 700 sqm stand in Upington zoned for residential development—perfect opportunity to build your dream home."}
{"input": "2 bedrooms, 1 bathroom, East London, apartment, first floor, parking bay, balcony", "output": "Well-maintained 2-bedroom apartment in East London with a balcony, first-floor access, and a secure parking bay."}
{"input": "6 bedrooms, 5 bathrooms, Pretoria, mansion, pool, gym room, triple garage, landscaped garden", "output": "Grand 6-bedroom mansion in Pretoria with a gym room, triple garage, swimming pool, and beautifully landscaped garden."}
{"input": "1 bedroom, 1 bathroom, Stellenbosch, student flat, shared kitchen, furnished, secure block", "output": "Furnished 1-bedroom student flat in Stellenbosch with shared kitchen, secure block entry, and ideal location near campus."}
{"input": "3 bedrooms, 2 bathrooms, Gansbaai, house, sea views, entertainment deck, garage", "output": "Relaxed 3-bedroom home in Gansbaai with sea views, entertainment deck, and secure garage—ideal for coastal living."}
{"input": "plot, 450 sqm, Kathu, residential stand, fenced, near school, ready to build", "output": "Fenced 450 sqm residential stand in Kathu located near schools and fully serviced—ideal for starting construction immediately."}
{"input": "4 bedrooms, 3 bathrooms, Paarl, estate home, braai area, pool, garden, double garage", "output": "Beautiful 4-bedroom estate home in Paarl with a braai patio, pool, landscaped garden, and double garage in a secure estate."}
{"input": "2 bedrooms, 1 bathroom, Pretoria North, apartment, tiled floors, balcony, covered parking", "output": "Tidy 2-bedroom apartment in Pretoria North with tiled floors, a private balcony, and covered parking in a quiet complex."}
{"input": "3 bedrooms, 2 bathrooms, Vaalpark, house, double garage, large stand, quiet area", "output": "Spacious 3-bedroom home in Vaalpark with a double garage, large stand, and located in a peaceful residential neighborhood."}
{"input": "5 bedrooms, 4 bathrooms, Cape Town, villa, sea views, rooftop deck, entertainment area", "output": "Breathtaking 5-bedroom villa in Cape Town with panoramic sea views, rooftop entertainment deck, and luxurious finishes throughout."}
{"input": "3 bedrooms, 2 bathrooms, Port Elizabeth, townhouse, enclosed patio, double carport, safe area", "output": "Neat 3-bedroom townhouse in Port Elizabeth with an enclosed patio, double carport, and located in a safe family neighborhood."}
{"input": "vacant land, 1200 sqm, Mossel Bay, elevated stand, ocean views, cul-de-sac", "output": "Large 1200 sqm elevated stand in Mossel Bay with sweeping ocean views and positioned in a quiet cul-de-sac—ready for development."}
{"input": "2 bedrooms, 1 bathroom, Kimberley, flat, first floor, secure block, parking bay", "output": "Neat 2-bedroom flat on the first floor in Kimberley with a parking bay and secure access in a well-maintained complex."}
{"input": "3 bedrooms, 2 bathrooms, Mbombela, townhouse, lock-up garage, private garden, tiled floors", "output": "Modern 3-bedroom townhouse in Mbombela with tiled floors, a private garden, and a secure lock-up garage in a quiet complex."}
{"input": "4 bedrooms, 3 bathrooms, Soweto, house, double-storey, balcony, carport", "output": "Spacious double-storey 4-bedroom house in Soweto with balconies, ample parking, and a large carport—ideal for large families."}
{"input": "1 bedroom, 1 bathroom, Bellville, apartment, student-friendly, furnished, walk to shops", "output": "Furnished 1-bedroom apartment in Bellville, perfect for students, located within walking distance to shops and public transport."}
{"input": "5 bedrooms, 5 bathrooms, Durban North, luxury home, pool, sea views, entertainment room", "output": "Elegant 5-bedroom luxury home in Durban North with sea views, an entertainment room, and a private pool—perfect for high-end living."}
{"input": "3 bedrooms, 2 bathrooms, Brakpan, house, large yard, garage, covered patio", "output": "Well-priced 3-bedroom house in Brakpan with a large yard, single garage, and a covered patio for outdoor enjoyment."}
{"input": "2 bedrooms, 1 bathroom, Uitenhage, townhouse, pet-friendly, garden, secure complex", "output": "Pet-friendly 2-bedroom townhouse in Uitenhage with a private garden and 24/7 security in a well-kept complex."}
{"input": "4 bedrooms, 2 bathrooms, George, freestanding house, garage, workshop, spacious yard", "output": "4-bedroom freestanding house in George with a spacious yard, secure garage, and a dedicated workshop area."}
{"input": "plot, 850 sqm, Jeffreys Bay, near beach, sea breeze, serviced, elevated position", "output": "Scenic 850 sqm plot in Jeffreys Bay with partial sea views, services installed, and just minutes from the beach."}
{"input": "3 bedrooms, 2 bathrooms, Vanderbijlpark, townhouse, open-plan kitchen, garden, garage", "output": "Charming 3-bedroom townhouse in Vanderbijlpark featuring an open-plan kitchen, garden space, and a single garage."}
{"input": "6 bedrooms, 5 bathrooms, Sandton, luxury home, pool, staff quarters, smart home features", "output": "State-of-the-art 6-bedroom home in Sandton with smart home features, a private pool, and staff quarters—true executive living."}
{"input": "2 bedrooms, 1 bathroom, Rustenburg, apartment, first floor, tiled, parking", "output": "Affordable 2-bedroom apartment in Rustenburg on the first floor, tiled throughout, with a designated parking bay."}
{"input": "4 bedrooms, 2 bathrooms, Vereeniging, house, double garage, garden, entertainment patio", "output": "Spacious 4-bedroom home in Vereeniging with a double garage, entertainment patio, and garden—ideal for families."}
{"input": "3 bedrooms, 2 bathrooms, Richards Bay, cluster home, fenced garden, secure gate, carport", "output": "Modern 3-bedroom cluster home in Richards Bay with a fenced garden, secure entrance, and a covered carport."}
{"input": "2 bedrooms, 1 bathroom, Mossel Bay, apartment, lock-up garage, balcony, coastal views", "output": "Bright 2-bedroom apartment in Mossel Bay with a balcony offering coastal views and a secure lock-up garage."}
{"input": "5 bedrooms, 3 bathrooms, Paarl, house, swimming pool, entertainment room, triple garage", "output": "Elegant 5-bedroom home in Paarl with a sparkling swimming pool, entertainment space, and a spacious triple garage."}
{"input": "1 bedroom, 1 bathroom, Randburg, bachelor flat, compact kitchen, close to transport", "output": "Affordable bachelor flat in Randburg with a compact kitchen and easy access to public transport and shops."}
{"input": "3 bedrooms, 2 bathrooms, East London, duplex, secure complex, garage, private courtyard", "output": "Secure 3-bedroom duplex in East London featuring a private courtyard, single garage, and security-controlled access."}
{"input": "4 bedrooms, 2 bathrooms, Johannesburg South, house, pool, paved yard, lounge, garage", "output": "Spacious 4-bedroom house in Johannesburg South with a pool, paved yard, lounge area, and a lock-up garage."}
{"input": "vacant land, 600 sqm, Stilfontein, residential plot, near schools, services available", "output": "Level 600 sqm residential plot in Stilfontein near local schools, fully serviced and ready for construction."}
{"input": "2 bedrooms, 1 bathroom, Worcester, apartment, ground floor, garden access, parking", "output": "Ground-floor 2-bedroom apartment in Worcester with direct garden access and secure parking in a quiet block."}
{"input": "3 bedrooms, 2 bathrooms, Secunda, house, entertainment area, double garage, fireplace", "output": "Well-kept 3-bedroom house in Secunda featuring a fireplace, entertainment area, and a spacious double garage."}
{"input": "4 bedrooms, 3 bathrooms, Upington, house, pool, braai area, secure fence", "output": "Large 4-bedroom home in Upington with a swimming pool, outdoor braai area, and full perimeter security fencing."}
{"input": "1 bedroom, 1 bathroom, Vanderbijlpark, flat, furnished, student-friendly, secure block", "output": "Furnished 1-bedroom flat in Vanderbijlpark, ideal for students, with secure access and close proximity to campus."}
{"input": "5 bedrooms, 4 bathrooms, Stellenbosch, estate home, wine cellar, pool, views", "output": "Luxury 5-bedroom estate home in Stellenbosch with wine cellar, pool, and breathtaking mountain views."}
{"input": "3 bedrooms, 1.5 bathrooms, Oudtshoorn, house, garage, yard, tiled floors", "output": "Affordable 3-bedroom home in Oudtshoorn with tiled floors, single garage, and a spacious enclosed yard."}
{"input": "2 bedrooms, 1 bathroom, Klerksdorp, apartment, balcony, carport, tiled throughout", "output": "Tiled 2-bedroom apartment in Klerksdorp with a private balcony and covered parking bay in a well-maintained block."}
{"input": "4 bedrooms, 2 bathrooms, East London, freestanding house, pool, double carport, garden", "output": "Spacious 4-bedroom freestanding house in East London with a private pool, double carport, and lush garden."}
{"input": "plot, 1000 sqm, Rustenburg, flat stand, fenced, residential zoning, services available", "output": "1000 sqm flat, fenced residential stand in Rustenburg with all services installed—ready for development."}
{"input": "3 bedrooms, 2 bathrooms, Bellville, duplex, garage, enclosed yard, close to schools", "output": "Family-friendly 3-bedroom duplex in Bellville with a garage, enclosed yard, and located near excellent schools."}
{"input": "6 bedrooms, 4 bathrooms, Durban, mansion, ocean views, pool, luxury finishes", "output": "Magnificent 6-bedroom mansion in Durban with panoramic ocean views, pool, and world-class luxury finishes."}
{"input": "2 bedrooms, 1 bathroom, Sasolburg, townhouse, tiled floors, garden, parking", "output": "Neat 2-bedroom townhouse in Sasolburg with tiled floors, private garden, and secure parking space."}
{"input": "4 bedrooms, 3 bathrooms, Pretoria East, house, patio, fireplace, large garden", "output": "Charming 4-bedroom home in Pretoria East with a large garden, covered patio, and a cozy fireplace for family living."}
{"input": "3 bedrooms, 2 bathrooms, Welkom, house, lounge, carport, fully fenced yard", "output": "Solid 3-bedroom house in Welkom with a spacious lounge, full fencing, and a covered carport for secure parking."}
{"input": "2 bedrooms, 2 bathrooms, Ballito, apartment, balcony, sea views, security estate", "output": "Stunning 2-bedroom apartment in Ballito with a sea-facing balcony, modern design, and located in a secure estate."}
{"input": "5 bedrooms, 3 bathrooms, Paarl, modern house, braai room, swimming pool, garage", "output": "Contemporary 5-bedroom house in Paarl with a braai room, sparkling swimming pool, and a double garage."}
{"input": "1 bedroom, 1 bathroom, Cape Town, studio, city views, furnished, security block", "output": "Furnished 1-bedroom studio apartment in Cape Town with panoramic city views and top-tier building security."}
{"input": "3 bedrooms, 2 bathrooms, Kathu, townhouse, secure complex, garage, small garden", "output": "Secure 3-bedroom townhouse in Kathu with a single garage, low-maintenance garden, and 24/7 access control."}
{"input": "4 bedrooms, 3 bathrooms, Polokwane, freestanding house, office, garden, parking", "output": "Versatile 4-bedroom home in Polokwane with a home office, garden, and ample secure parking for multiple vehicles."}
{"input": "vacant land, 1500 sqm, George, residential zoning, near schools, partially cleared", "output": "Large 1500 sqm residential plot in George, partially cleared and situated near schools—ideal for family home development."}
{"input": "2 bedrooms, 1 bathroom, Bloemfontein, townhouse, garden, lock-up garage, quiet street", "output": "Cozy 2-bedroom townhouse in Bloemfontein with a private garden, lock-up garage, and situated on a peaceful street."}
{"input": "3 bedrooms, 2 bathrooms, Boksburg, simplex, pet-friendly, garden, carport", "output": "Pet-friendly 3-bedroom simplex in Boksburg with a private garden and shaded carport, perfect for families with small pets."}
{"input": "4 bedrooms, 3 bathrooms, Pretoria, house, solar system, entertainment area, double garage", "output": "Spacious 4-bedroom family home in Pretoria featuring a solar power system, large entertainment area, and a double garage."}
{"input": "1 bedroom, 1 bathroom, Sandton, apartment, modern finishes, balcony, secure block", "output": "Modern 1-bedroom apartment in Sandton with stylish finishes, a private balcony, and excellent building security."}
{"input": "5 bedrooms, 4 bathrooms, Centurion, double-storey house, pool, garden, office", "output": "Luxurious 5-bedroom double-storey home in Centurion with a private pool, landscaped garden, and a home office."}
{"input": "3 bedrooms, 1.5 bathrooms, East London, house, sea views, enclosed yard, garage", "output": "Charming 3-bedroom home in East London with ocean views, enclosed yard, and a single garage for secure parking."}
{"input": "2 bedrooms, 1 bathroom, Alberton, apartment, ground floor, garden access, security complex", "output": "Ground-floor 2-bedroom apartment in Alberton with direct garden access and situated in a secure complex."}
{"input": "4 bedrooms, 2.5 bathrooms, Nelspruit, family home, deck, views, garage", "output": "Inviting 4-bedroom family home in Nelspruit with a scenic deck, stunning views, and double garage."}
{"input": "3 bedrooms, 2 bathrooms, Soweto, house, paved yard, carport, gate", "output": "Secure 3-bedroom house in Soweto with a fully paved yard, gated entrance, and shaded carport."}
{"input": "6 bedrooms, 5 bathrooms, Stellenbosch, villa, wine estate, mountain views, pool", "output": "Exquisite 6-bedroom villa in Stellenbosch wine estate with mountain views and a sparkling pool."}
{"input": "1 bedroom, 1 bathroom, Durban CBD, bachelor flat, lift access, security desk, parking", "output": "Affordable 1-bedroom bachelor flat in Durban CBD with lift access, 24/7 security, and designated parking."}
{"input": "3 bedrooms, 2 bathrooms, Port Elizabeth, freestanding house, braai area, pet-friendly, yard", "output": "Freestanding 3-bedroom home in Port Elizabeth with a pet-friendly yard and built-in braai area."}
{"input": "4 bedrooms, 2 bathrooms, Kimberley, house, borehole, lounge, undercover patio", "output": "Spacious 4-bedroom house in Kimberley with a borehole, large lounge, and undercover entertainment patio."}
{"input": "2 bedrooms, 1 bathroom, Bellville, apartment, first floor, balcony, secure gate", "output": "Neat 2-bedroom first-floor apartment in Bellville with private balcony and secure gated access."}
{"input": "5 bedrooms, 3 bathrooms, Somerset West, modern home, double garage, scullery, landscaped garden", "output": "Contemporary 5-bedroom home in Somerset West with scullery, landscaped garden, and double garage."}
{"input": "3 bedrooms, 2 bathrooms, Pretoria North, duplex, courtyard, garden, garage", "output": "Stylish 3-bedroom duplex in Pretoria North with a private courtyard, lush garden, and lock-up garage."}
{"input": "2 bedrooms, 1 bathroom, Richards Bay, townhouse, small pets allowed, parking, fenced yard", "output": "Secure 2-bedroom townhouse in Richards Bay with pet-friendly fenced yard and designated parking."}
{"input": "4 bedrooms, 3 bathrooms, Roodepoort, house, domestic quarters, double garage, patio", "output": "Versatile 4-bedroom home in Roodepoort with domestic quarters, double garage, and a large entertainment patio."}
{"input": "1 bedroom, 1 bathroom, Green Point, Cape Town, studio apartment, balcony, sea views", "output": "Stylish 1-bedroom studio in Green Point with balcony and breathtaking sea views."}
{"input": "3 bedrooms, 2 bathrooms, Middelburg, house, large plot, garage, entertainment room", "output": "3-bedroom house in Middelburg on a large plot with entertainment room and secure garage."}
{"input": "5 bedrooms, 4 bathrooms, Bryanston, luxury home, wine cellar, pool, garden", "output": "Ultra-luxury 5-bedroom home in Bryanston with private wine cellar, landscaped garden, and entertainment pool."}
{"input": "3 bedrooms, 2 bathrooms, Krugersdorp, townhouse, open-plan kitchen, garage, braai area", "output": "Modern 3-bedroom townhouse in Krugersdorp with open-plan kitchen, private garage, and covered braai area."}
{"input": "2 bedrooms, 1 bathroom, Pietermaritzburg, flat, first floor, remote access gate, carport", "output": "Secure 2-bedroom flat in Pietermaritzburg with carport and remote access security gate."}
{"input": "4 bedrooms, 3 bathrooms, Langebaan, home, lagoon views, open-plan living, double garage", "output": "Beautiful 4-bedroom home in Langebaan with lagoon views, spacious open-plan design, and double garage."}
{"input": "3 bedrooms, 2 bathrooms, Rustenburg, house, solar geyser, garage, fenced yard", "output": "Energy-efficient 3-bedroom house in Rustenburg with solar geyser, secure fencing, and lock-up garage."}
{"input": "3 bedrooms, 2 bathrooms, Vanderbijlpark, family home, lapa, garden, double garage", "output": "Lovely 3-bedroom family home in Vanderbijlpark featuring a private lapa, landscaped garden, and a spacious double garage."}
{"input": "2 bedrooms, 1 bathroom, Milnerton, apartment, sea view, parking bay, security complex", "output": "Modern 2-bedroom apartment in Milnerton with sea views, secure parking bay, and 24/7 security-controlled access."}
{"input": "4 bedrooms, 2 bathrooms, George, freestanding house, fireplace, patio, garage", "output": "Spacious 4-bedroom freestanding house in George with a cozy fireplace, entertainment patio, and a secure garage."}
{"input": "1 bedroom, 1 bathroom, Hatfield, student flat, furnished, walking distance to campus", "output": "Furnished 1-bedroom flat in Hatfield, ideal for students and located within walking distance to campus and transport."}
{"input": "5 bedrooms, 4 bathrooms, Bedfordview, mansion, triple garage, pool, staff quarters", "output": "Luxurious 5-bedroom mansion in Bedfordview boasting a triple garage, sparkling pool, and separate staff accommodation."}
{"input": "3 bedrooms, 1.5 bathrooms, Klerksdorp, house, tiled floors, lounge, double carport", "output": "Neat 3-bedroom home in Klerksdorp with tiled floors, spacious lounge, and a double carport for added convenience."}
{"input": "2 bedrooms, 1 bathroom, Garsfontein, townhouse, private garden, pet-friendly, parking", "output": "Charming 2-bedroom townhouse in Garsfontein with a pet-friendly garden, open-plan layout, and secure parking."}
{"input": "4 bedrooms, 3 bathrooms, Brackenfell, family house, braai room, pool, garage", "output": "Family-friendly 4-bedroom house in Brackenfell with a built-in braai room, pool, and double garage."}
{"input": "1 bedroom, 1 bathroom, Maboneng, loft apartment, city views, modern design", "output": "Trendy 1-bedroom loft in Maboneng with contemporary finishes and expansive city views from the living area."}
{"input": "3 bedrooms, 2 bathrooms, Benoni, cluster home, garden, security estate, double garage", "output": "Modern 3-bedroom cluster in Benoni with private garden, double garage, and located in a secure estate."}
{"input": "2 bedrooms, 1 bathroom, Uitenhage, flat, enclosed balcony, built-in cupboards, parking", "output": "Well-maintained 2-bedroom flat in Uitenhage with built-in cupboards, enclosed balcony, and off-street parking."}
{"input": "4 bedrooms, 2 bathrooms, Randburg, home, garden, study, pool, borehole", "output": "Versatile 4-bedroom home in Randburg with a home office, lush garden, pool, and borehole water supply."}
{"input": "3 bedrooms, 2 bathrooms, Mossel Bay, duplex, ocean views, balcony, garage", "output": "Sea-facing 3-bedroom duplex in Mossel Bay with a balcony, modern layout, and secure garage."}
{"input": "5 bedrooms, 3 bathrooms, Bloemfontein, house, flatlet, entertainment patio, garage", "output": "Spacious 5-bedroom home in Bloemfontein with a self-contained flatlet, entertainment patio, and secure garage."}
{"input": "2 bedrooms, 1 bathroom, Brits, simplex, small garden, lock-up garage, pet-friendly", "output": "Comfortable 2-bedroom simplex in Brits with a pet-friendly garden and secure lock-up garage."}
{"input": "3 bedrooms, 2 bathrooms, Amanzimtoti, apartment, sea views, balcony, undercover parking", "output": "Beachside 3-bedroom apartment in Amanzimtoti with stunning sea views, a spacious balcony, and undercover parking."}
{"input": "4 bedrooms, 3 bathrooms, Witbank, house, study, solar panels, double garage", "output": "Modern 4-bedroom home in Witbank with a private study, solar energy system, and large double garage."}
{"input": "3 bedrooms, 1 bathroom, Durban North, cottage, garden, open-plan kitchen, patio", "output": "Charming 3-bedroom cottage in Durban North with a sunny patio, open-plan kitchen, and lush garden."}
{"input": "2 bedrooms, 1 bathroom, Potchefstroom, student apartment, wifi, security gate, parking", "output": "Ideal 2-bedroom student apartment in Potchefstroom with Wi-Fi, secure gated access, and dedicated parking."}
{"input": "4 bedrooms, 2 bathrooms, Kimberley, freestanding home, carport, fenced yard, garden", "output": "Neat 4-bedroom freestanding home in Kimberley with fenced yard, carport, and a spacious garden for family living."}
{"input": "3 bedrooms, 2 bathrooms, East London, townhouse, garden, secure complex, double garage", "output": "Well-kept 3-bedroom townhouse in East London with a neat garden, double garage, and located in a secure complex."}
{"input": "1 bedroom, 1 bathroom, Johannesburg CBD, apartment, furnished, close to transport", "output": "Fully furnished 1-bedroom apartment in Johannesburg CBD with easy access to transport and city amenities."}
{"input": "4 bedrooms, 3 bathrooms, Somerset West, house, pool, mountain views, entertainment area", "output": "Elegant 4-bedroom home in Somerset West with a pool, mountain views, and an entertainer’s patio for relaxing weekends."}
{"input": "2 bedrooms, 1 bathroom, Boksburg, flat, balcony, tiled floors, covered parking", "output": "Spacious 2-bedroom flat in Boksburg with tiled floors, a private balcony, and covered parking included."}
{"input": "5 bedrooms, 4 bathrooms, Sandton, luxury house, wine cellar, cinema room, triple garage", "output": "Exquisite 5-bedroom luxury home in Sandton featuring a private wine cellar, home cinema, and a triple garage."}
{"input": "3 bedrooms, 1.5 bathrooms, Rustenburg, family home, garden, carport, open-plan kitchen", "output": "Affordable 3-bedroom family home in Rustenburg with a garden, carport, and modern open-plan kitchen."}
{"input": "2 bedrooms, 2 bathrooms, Jeffreys Bay, beachfront apartment, sea view, balcony, security", "output": "Prime beachfront 2-bedroom apartment in Jeffreys Bay with stunning sea views, large balcony, and 24/7 security."}
{"input": "4 bedrooms, 2 bathrooms, Alberton, house, braai area, lounge, double garage", "output": "Charming 4-bedroom home in Alberton with a built-in braai area, spacious lounge, and a double garage."}
{"input": "3 bedrooms, 2 bathrooms, Nelspruit, house, scenic views, patio, pet-friendly", "output": "Stylish 3-bedroom house in Nelspruit with scenic views, a covered patio, and a pet-friendly garden."}
{"input": "2 bedrooms, 1 bathroom, Roodepoort, apartment, fibre-ready, parking, security", "output": "Modern 2-bedroom apartment in Roodepoort with fibre connectivity, secure parking, and 24-hour access control."}
{"input": "4 bedrooms, 2 bathrooms, Centurion, family house, staff quarters, pool, garage", "output": "Spacious 4-bedroom family house in Centurion with a pool, double garage, and separate staff accommodation."}
{"input": "1 bedroom, 1 bathroom, Stellenbosch, student apartment, furnished, wifi, close to university", "output": "Furnished 1-bedroom student apartment in Stellenbosch with Wi-Fi and walking distance to campus."}
{"input": "5 bedrooms, 3 bathrooms, Knysna, home, lagoon views, deck, fireplace", "output": "Gorgeous 5-bedroom home in Knysna with breathtaking lagoon views, a wooden deck, and a cozy fireplace."}
{"input": "2 bedrooms, 1 bathroom, Port Elizabeth, flat, tiled floors, communal garden, parking", "output": "Affordable 2-bedroom flat in Port Elizabeth with tiled flooring, access to a communal garden, and allocated parking."}
{"input": "3 bedrooms, 2 bathrooms, Queenstown, duplex, garage, lounge, enclosed yard", "output": "Secure 3-bedroom duplex in Queenstown with enclosed yard, spacious lounge, and single garage."}
{"input": "4 bedrooms, 2 bathrooms, Newcastle, freestanding house, flatlet, pool, garage", "output": "Solid 4-bedroom freestanding house in Newcastle with a separate flatlet, pool, and double garage."}
{"input": "2 bedrooms, 1 bathroom, Secunda, townhouse, garden, lock-up garage, quiet area", "output": "Peaceful 2-bedroom townhouse in Secunda with private garden, lock-up garage, and situated in a quiet suburb."}
{"input": "3 bedrooms, 2 bathrooms, Margate, apartment, beach access, sea views, pool", "output": "Coastal 3-bedroom apartment in Margate with direct beach access, sea views, and a communal pool."}
{"input": "1 bedroom, 1 bathroom, Midrand, bachelor flat, open-plan, secure complex, parking", "output": "Open-plan 1-bedroom bachelor flat in Midrand with secure access, modern design, and convenient parking."}
{"input": "4 bedrooms, 3 bathrooms, Bela-Bela, house, borehole, entertainment patio, double carport", "output": "Immaculate 4-bedroom house in Bela-Bela with borehole water supply, large patio for entertaining, and a double carport."}
{"input": "3 bedrooms, 2 bathrooms, Bloemfontein, family home, fireplace, double garage, garden", "output": "Warm and inviting 3-bedroom family home in Bloemfontein featuring a cozy fireplace, double garage, and spacious garden—perfect for family living."}
{"input": "2 bedrooms, 1 bathroom, Krugersdorp, apartment, balcony, open-plan kitchen, secure parking", "output": "Modern 2-bedroom apartment in Krugersdorp with an open-plan kitchen, sunny balcony, and secure parking in a well-managed complex."}
{"input": "4 bedrooms, 2 bathrooms, East London, house, entertainment area, braai, garage", "output": "Spacious 4-bedroom home in East London with a dedicated entertainment area, built-in braai, and secure garage for comfortable family life."}
{"input": "3 bedrooms, 1.5 bathrooms, Port Elizabeth, townhouse, pet-friendly, garage, near schools", "output": "Neat and pet-friendly 3-bedroom townhouse in Port Elizabeth with a garage and convenient access to top schools."}
{"input": "5 bedrooms, 3 bathrooms, Sandton, luxury house, pool, study, staff quarters", "output": "Prestigious 5-bedroom luxury home in Sandton offering a pool, private study, and full staff quarters in an exclusive neighbourhood."}
{"input": "1 bedroom, 1 bathroom, Stellenbosch, student apartment, furnished, walking distance to campus", "output": "Furnished 1-bedroom student apartment in Stellenbosch within walking distance to campus—ideal for students seeking convenience and comfort."}
{"input": "3 bedrooms, 2 bathrooms, Centurion, simplex, garden, double garage, low levies", "output": "Well-maintained 3-bedroom simplex in Centurion featuring a private garden, double garage, and low monthly levies."}
{"input": "2 bedrooms, 1 bathroom, Brakpan, flat, ground floor, parking bay, prepaid electricity", "output": "Affordable 2-bedroom ground-floor flat in Brakpan with a dedicated parking bay and prepaid electricity for budget-conscious buyers."}
{"input": "4 bedrooms, 3 bathrooms, Nelspruit, house, garden, patio, scenic views", "output": "Elegant 4-bedroom home in Nelspruit with scenic views, manicured garden, and covered patio perfect for outdoor entertainment."}
{"input": "3 bedrooms, 2 bathrooms, Witbank, duplex, garage, garden, close to transport", "output": "Modern 3-bedroom duplex in Witbank featuring a single garage, secure garden, and easy access to public transport routes."}
{"input": "6 bedrooms, 5 bathrooms, Umhlanga, mansion, sea views, triple garage, luxury finishes", "output": "Breathtaking 6-bedroom mansion in Umhlanga boasting panoramic sea views, triple garage, and exceptional luxury finishes throughout."}
{"input": "2 bedrooms, 1 bathroom, Vanderbijlpark, apartment, lock-up garage, complex pool", "output": "Neat 2-bedroom apartment in Vanderbijlpark with a lock-up garage and access to a communal pool in a secure complex."}
{"input": "4 bedrooms, 3 bathrooms, Kimberley, house, study, garden, double carport", "output": "Spacious 4-bedroom home in Kimberley with a private study, lush garden, and double carport for secure parking."}
{"input": "3 bedrooms, 2 bathrooms, Rustenburg, cluster home, secure estate, modern kitchen", "output": "Stylish 3-bedroom cluster home in a secure Rustenburg estate featuring a modern kitchen and quality finishes."}
{"input": "1 bedroom, 1 bathroom, Johannesburg CBD, bachelor flat, tiled floors, 24-hour security", "output": "Compact and secure 1-bedroom bachelor flat in Johannesburg CBD with tiled flooring and 24-hour security."}
{"input": "5 bedrooms, 3.5 bathrooms, Randburg, family home, pool, kids play area, entertainment patio", "output": "Expansive 5-bedroom family home in Randburg with pool, kids' play zone, and an entertainment-ready patio."}
{"input": "2 bedrooms, 2 bathrooms, Mossel Bay, apartment, balcony, sea view, garage", "output": "Charming 2-bedroom apartment in Mossel Bay with a sea-facing balcony and lock-up garage in a secure development."}
{"input": "4 bedrooms, 2.5 bathrooms, Midrand, double-storey house, garden, lounge, scullery", "output": "Elegant 4-bedroom double-storey home in Midrand with a spacious garden, formal lounge, and convenient scullery area."}
{"input": "3 bedrooms, 2 bathrooms, Upington, townhouse, single garage, air conditioning", "output": "Comfortable 3-bedroom townhouse in Upington with air conditioning, single garage, and easy access to local amenities."}
{"input": "2 bedrooms, 1 bathroom, Malmesbury, apartment, tiled, built-in cupboards, secure block", "output": "Affordable 2-bedroom apartment in Malmesbury with tiled interiors, built-in cupboards, and set in a secure complex."}
{"input": "3 bedrooms, 2 bathrooms, Potchefstroom, house, open-plan, carport, fenced yard", "output": "Open-plan 3-bedroom home in Potchefstroom with a secure carport and fenced yard—ideal for families."}
{"input": "5 bedrooms, 4 bathrooms, Houghton, luxury home, home theatre, gym, pool", "output": "Exceptional 5-bedroom luxury home in Houghton featuring a home theatre, private gym, and sparkling pool—designed for elite living."}
{"input": "1 bedroom, 1 bathroom, Durban CBD, flat, lift access, city views", "output": "Affordable 1-bedroom flat in Durban CBD with lift access and impressive city views—ideal for professionals or students."}
{"input": "4 bedrooms, 3 bathrooms, Roodepoort, freestanding house, double garage, patio", "output": "Well-maintained 4-bedroom freestanding home in Roodepoort with a double garage and covered patio for entertaining."}
{"input": "2 bedrooms, 1 bathroom, Jeffreys Bay, beachfront apartment, parking, braai area", "output": "Seaside 2-bedroom apartment in Jeffreys Bay with beachfront access, secure parking, and built-in braai facilities."}
{"input": "4 bedrooms, 2 bathrooms, Potchefstroom, freestanding house, garden, carport, fireplace", "output": "Spacious 4-bedroom freestanding house in Potchefstroom with a lush garden, double carport, and a cozy fireplace—ideal for family comfort."}
{"input": "3 bedrooms, 1.5 bathrooms, Bloemfontein, apartment, balcony, lock-up garage, close to shops", "output": "Modern 3-bedroom apartment in Bloemfontein with a private balcony, lock-up garage, and walking distance to shopping amenities."}
{"input": "2 bedrooms, 1 bathroom, Kraaifontein, flat, built-in cupboards, tiled floors, gated complex", "output": "Well-maintained 2-bedroom flat in Kraaifontein featuring built-in cupboards, tiled floors, and 24-hour security in a gated complex."}
{"input": "5 bedrooms, 4 bathrooms, Rustenburg, house, pool, double garage, mountain views", "output": "Elegant 5-bedroom house in Rustenburg offering mountain views, a sparkling pool, and a spacious double garage—luxury living at its best."}
{"input": "3 bedrooms, 2 bathrooms, Nelspruit, duplex, balcony, garage, pet-friendly", "output": "Pet-friendly 3-bedroom duplex in Nelspruit with a sunny balcony, single garage, and spacious living for the whole family."}
{"input": "1 bedroom, 1 bathroom, Umhlanga, apartment, sea views, modern finishes, 24hr security", "output": "Stylish 1-bedroom apartment in Umhlanga with breathtaking sea views, modern finishes, and 24-hour manned security."}
{"input": "4 bedrooms, 3 bathrooms, Randburg, house, study, pool, entertainment area", "output": "Versatile 4-bedroom family house in Randburg with a dedicated study, pool, and covered entertainment area—perfect for hosting."}
{"input": "3 bedrooms, 2 bathrooms, East London, townhouse, lock-up garage, patio, garden", "output": "Secure 3-bedroom townhouse in East London with a patio, private garden, and a convenient lock-up garage."}
{"input": "2 bedrooms, 1 bathroom, Witbank, apartment, open-plan kitchen, parking bay, secure block", "output": "Neat 2-bedroom apartment in Witbank featuring an open-plan kitchen, dedicated parking bay, and set in a secure complex."}
{"input": "6 bedrooms, 5 bathrooms, Sandton, mansion, cinema room, gym, smart home", "output": "Breathtaking 6-bedroom smart mansion in Sandton with a private cinema, gym, and ultra-modern design—luxury redefined."}
{"input": "3 bedrooms, 2.5 bathrooms, Benoni, cluster home, double garage, patio, communal park", "output": "Contemporary 3-bedroom cluster in Benoni with a double garage, covered patio, and access to a beautifully maintained communal park."}
{"input": "2 bedrooms, 1 bathroom, Stellenbosch, student apartment, walking distance to university, wifi included", "output": "Convenient 2-bedroom student apartment in Stellenbosch, just steps from campus, with free Wi-Fi and secure access."}
{"input": "4 bedrooms, 3 bathrooms, Kimberley, house, flatlet, garage, borehole", "output": "Well-appointed 4-bedroom house in Kimberley with a separate flatlet, borehole, and secure double garage."}
{"input": "3 bedrooms, 2 bathrooms, Vanderbijlpark, family home, large garden, double carport", "output": "Family-focused 3-bedroom home in Vanderbijlpark with a large fenced garden and double carport for secure parking."}
{"input": "5 bedrooms, 4 bathrooms, Roodepoort, luxury home, pool, cinema room, bar", "output": "Lavish 5-bedroom residence in Roodepoort with a home cinema, built-in bar, and sparkling pool—perfect for upscale entertainment."}
{"input": "2 bedrooms, 1 bathroom, Midrand, apartment, clubhouse access, covered parking, top floor", "output": "Modern top-floor 2-bedroom apartment in Midrand with covered parking, clubhouse access, and stunning complex views."}
{"input": "3 bedrooms, 2 bathrooms, Krugersdorp, house, built-in braai, garden, garage", "output": "Lovely 3-bedroom house in Krugersdorp with built-in braai, neat garden, and secure garage—move-in ready."}
{"input": "4 bedrooms, 2 bathrooms, Jeffreys Bay, coastal house, sea views, entertainment deck", "output": "Coastal 4-bedroom home in Jeffreys Bay with panoramic sea views, entertainment deck, and relaxed beachside living."}
{"input": "1 bedroom, 1 bathroom, Sandton CBD, studio apartment, basement parking, rooftop pool", "output": "Executive 1-bedroom studio in Sandton CBD with basement parking, rooftop pool, and prime business district location."}
{"input": "3 bedrooms, 2 bathrooms, Queenstown, freestanding house, firepit, large yard, double garage", "output": "Comfortable 3-bedroom freestanding house in Queenstown with a large yard, firepit, and spacious double garage."}
{"input": "4 bedrooms, 3.5 bathrooms, Durban North, villa, pool, double-storey, luxury finishes", "output": "Prestigious 4-bedroom double-storey villa in Durban North featuring luxury finishes, a sparkling pool, and elegant modern design."}
{"input": "2 bedrooms, 1 bathroom, Port Elizabeth, retirement village, frail care, garden unit", "output": "Tranquil 2-bedroom garden unit in a Port Elizabeth retirement village with access to frail care and manicured communal areas."}
{"input": "3 bedrooms, 2 bathrooms, Rustenburg, townhouse, double garage, private patio", "output": "Spacious 3-bedroom townhouse in Rustenburg with a private patio and secure double garage in a quiet estate."}
{"input": "5 bedrooms, 4 bathrooms, Johannesburg, smart home, solar power, landscaped garden", "output": "Futuristic 5-bedroom smart home in Johannesburg with full solar power, a landscaped garden, and top-tier automation features."}
{"input": "3 bedrooms, 2 bathrooms, George, family home, fireplace, braai area, garage", "output": "Warm 3-bedroom family home in George with a fireplace, built-in braai area, and single garage—perfect for cosy evenings."}
{"input": "3 bedrooms, 1 bathroom, Kimberley, house, double carport, fenced yard, close to mall", "output": "Affordable 3-bedroom home in Kimberley with a double carport, fully fenced yard, and just minutes from the local mall."}
{"input": "2 bedrooms, 1 bathroom, East London, apartment, open-plan kitchen, sea views, balcony", "output": "Modern 2-bedroom apartment in East London with open-plan kitchen, scenic sea views, and a private balcony."}
{"input": "4 bedrooms, 2 bathrooms, Upington, family home, borehole, entertainment area, garage", "output": "Spacious 4-bedroom family home in Upington featuring a borehole, garage, and entertainment-ready outdoor area."}
{"input": "5 bedrooms, 3 bathrooms, Nelspruit, modern house, jungle gym, triple garage, landscaped yard", "output": "Elegant 5-bedroom home in Nelspruit with a landscaped yard, triple garage, and built-in jungle gym for kids."}
{"input": "2 bedrooms, 1 bathroom, Bethlehem, townhouse, pet-friendly, lock-up garage, security gate", "output": "Neat 2-bedroom townhouse in Bethlehem, pet-friendly and secure with a lock-up garage and gated access."}
{"input": "3 bedrooms, 2 bathrooms, Mahikeng, family home, large stand, study, carport", "output": "Comfortable 3-bedroom family home in Mahikeng with a study, large yard, and shaded carport."}
{"input": "1 bedroom, 1 bathroom, Port Elizabeth, flat, investment unit, close to beach, secure", "output": "Ideal investment 1-bedroom flat in Port Elizabeth near the beach, offering great rental return and secure living."}
{"input": "6 bedrooms, 5 bathrooms, Sandton, luxury mansion, wine cellar, pool, 4-car garage", "output": "Grand 6-bedroom mansion in Sandton with a wine cellar, pool, and four-car garage—perfect for executive living."}
{"input": "3 bedrooms, 1 bathroom, Vanderbijlpark, freestanding house, garden, single garage, quiet street", "output": "Well-maintained 3-bedroom home in Vanderbijlpark with a neat garden, single garage, and quiet residential setting."}
{"input": "4 bedrooms, 3 bathrooms, Middelburg, family home, entertainment area, pool, built-in braai", "output": "Stylish 4-bedroom family home in Middelburg with an entertainment zone, pool, and built-in braai."}
{"input": "3 bedrooms, 2 bathrooms, Pietermaritzburg, townhouse, double garage, pet-friendly, neat garden", "output": "Secure and pet-friendly 3-bedroom townhouse in Pietermaritzburg with a neat garden and double garage."}
{"input": "2 bedrooms, 2 bathrooms, Richards Bay, duplex, communal pool, secure complex, tiled floors", "output": "Chic 2-bedroom duplex in Richards Bay set in a secure complex with a communal pool and modern tiled finishes."}
{"input": "4 bedrooms, 2.5 bathrooms, Rustenburg, house, solar geyser, double garage, study", "output": "Energy-efficient 4-bedroom house in Rustenburg with a solar geyser, spacious study, and double garage."}
{"input": "1 bedroom, 1 bathroom, Bloemfontein, apartment, ground floor, private patio, student-friendly", "output": "Student-friendly 1-bedroom ground floor apartment in Bloemfontein with private patio and convenient access to amenities."}
{"input": "3 bedrooms, 2 bathrooms, Potchefstroom, family house, large garden, fireplace, undercover patio", "output": "Inviting 3-bedroom family home in Potchefstroom featuring a fireplace, large garden, and undercover patio."}
{"input": "2 bedrooms, 1 bathroom, Ermelo, flat, renovated kitchen, carport, quiet area", "output": "Renovated 2-bedroom flat in Ermelo with modern kitchen finishes, secure carport, and a peaceful environment."}
{"input": "5 bedrooms, 4 bathrooms, Somerset West, modern home, triple garage, scenic views, solar panels", "output": "Sustainable 5-bedroom home in Somerset West with solar panels, scenic views, and a spacious triple garage."}
{"input": "4 bedrooms, 3 bathrooms, Pretoria North, house, garden, pool, domestic quarters", "output": "Spacious 4-bedroom home in Pretoria North with a lush garden, pool, and separate domestic quarters."}
{"input": "3 bedrooms, 2 bathrooms, Newcastle, townhouse, secure complex, low levies, lock-up garage", "output": "Affordable 3-bedroom townhouse in Newcastle's secure complex with low levies and a lock-up garage."}
{"input": "2 bedrooms, 1 bathroom, Vanderbijlpark CE3, apartment, balcony, pre-paid electricity, parking bay", "output": "Convenient 2-bedroom apartment in Vanderbijlpark CE3 with pre-paid electricity, balcony, and secure parking bay."}
{"input": "3 bedrooms, 2 bathrooms, Midrand, duplex, private garden, double garage, secure estate", "output": "Modern 3-bedroom duplex in Midrand located in a secure estate with a private garden and double garage."}
{"input": "2 bedrooms, 1 bathroom, Port Elizabeth, apartment, tiled floors, balcony, sea views", "output": "Neat 2-bedroom apartment in Port Elizabeth with tiled floors, a private balcony, and scenic sea views."}
{"input": "4 bedrooms, 2.5 bathrooms, Bloemfontein, freestanding house, entertainment area, garage, pet friendly", "output": "Spacious 4-bedroom home in Bloemfontein featuring a covered entertainment area, pet-friendly yard, and secure garage."}
{"input": "1 bedroom, 1 bathroom, Stellenbosch, student apartment, close to campus, secure parking", "output": "Ideal student apartment in Stellenbosch with 1 bedroom, secure parking, and walking distance to campus."}
{"input": "3 bedrooms, 2 bathrooms, Boksburg, townhouse, modern kitchen, enclosed patio, lock-up garage", "output": "Chic 3-bedroom townhouse in Boksburg featuring a modern kitchen, enclosed patio, and secure lock-up garage."}
{"input": "5 bedrooms, 4 bathrooms, Sandton, luxury house, pool, staff quarters, triple garage", "output": "Exquisite 5-bedroom home in Sandton with a designer pool, staff accommodation, and a triple garage for ultimate luxury."}
{"input": "2 bedrooms, 2 bathrooms, Mossel Bay, coastal apartment, sea views, braai area, elevator access", "output": "Immaculate 2-bedroom coastal apartment in Mossel Bay with sea views, communal braai area, and elevator access."}
{"input": "3 bedrooms, 2 bathrooms, Rustenburg, house, borehole, double garage, patio", "output": "Family-friendly 3-bedroom home in Rustenburg with a borehole, double garage, and a covered patio for relaxation."}
{"input": "6 bedrooms, 5 bathrooms, Pretoria East, mansion, landscaped garden, pool, gym", "output": "Elegant 6-bedroom mansion in Pretoria East with a landscaped garden, private pool, and fully equipped gym."}
{"input": "2 bedrooms, 1 bathroom, East London, cottage, open-plan living, private courtyard", "output": "Charming 2-bedroom cottage in East London with open-plan living and a peaceful private courtyard."}
{"input": "4 bedrooms, 3 bathrooms, Vanderbijlpark, family house, lapa, pool, double carport", "output": "Inviting 4-bedroom family home in Vanderbijlpark with a lapa, sparkling pool, and double carport."}
{"input": "3 bedrooms, 2 bathrooms, Uitenhage, house, built-in cupboards, large yard", "output": "Solid 3-bedroom house in Uitenhage with built-in cupboards throughout and a large yard for pets or expansion."}
{"input": "2 bedrooms, 1 bathroom, Paarl, apartment, ground floor, parking bay", "output": "Convenient 2-bedroom ground floor apartment in Paarl with a dedicated parking bay and easy access to amenities."}
{"input": "5 bedrooms, 3 bathrooms, Centurion, double-storey house, study, pool, entertainers patio", "output": "Stylish 5-bedroom double-storey home in Centurion with a private study, pool, and entertainers patio."}
{"input": "1 bedroom, 1 bathroom, Hatfield, Pretoria, student apartment, furnished, secure block", "output": "Fully furnished 1-bedroom student apartment in Hatfield with excellent security and prime location."}
{"input": "3 bedrooms, 2 bathrooms, Roodepoort, simplex, garden, pets allowed", "output": "Well-maintained 3-bedroom simplex in Roodepoort with a private garden and pet-friendly policy."}
{"input": "4 bedrooms, 2 bathrooms, Durban North, family home, garden, entertainment area", "output": "Lovely 4-bedroom family home in Durban North with a spacious garden and designated entertainment area."}
{"input": "2 bedrooms, 1 bathroom, Vereeniging, apartment, top floor, parking, lift access", "output": "Top-floor 2-bedroom apartment in Vereeniging with secure parking and elevator access."}
{"input": "3 bedrooms, 2 bathrooms, George, cluster home, solar geyser, enclosed patio", "output": "Eco-conscious 3-bedroom cluster home in George with a solar geyser and enclosed patio for year-round use."}
{"input": "4 bedrooms, 3 bathrooms, Johannesburg South, house, fireplace, garden, domestic quarters", "output": "Spacious 4-bedroom home in Johannesburg South with a cozy fireplace, large garden, and domestic quarters."}
{"input": "3 bedrooms, 2 bathrooms, Cape Town, apartment, sea views, balcony, secure parking", "output": "Modern 3-bedroom apartment in Cape Town with breathtaking sea views, a private balcony, and secure parking."}
{"input": "4 bedrooms, 3 bathrooms, Johannesburg, freestanding house, garden, pool, double garage", "output": "Spacious 4-bedroom freestanding house in Johannesburg featuring a lush garden, sparkling pool, and a double garage."}
{"input": "2 bedrooms, 1 bathroom, Durban, townhouse, open-plan kitchen, patio, pet-friendly", "output": "Charming 2-bedroom townhouse in Durban with an open-plan kitchen, cozy patio, and pet-friendly policy."}
{"input": "5 bedrooms, 4 bathrooms, Pretoria, luxury villa, landscaped garden, home office, triple garage", "output": "Elegant 5-bedroom luxury villa in Pretoria boasting a landscaped garden, dedicated home office, and a triple garage."}
{"input": "1 bedroom, 1 bathroom, Sandton, studio apartment, modern finishes, rooftop pool, gym access", "output": "Stylish 1-bedroom studio apartment in Sandton with modern finishes, access to a rooftop pool, and a fully equipped gym."}
{"input": "3 bedrooms, 2 bathrooms, Port Elizabeth, duplex, sea-facing balcony, garage, secure complex", "output": "Contemporary 3-bedroom duplex in Port Elizabeth featuring a sea-facing balcony, single garage, and located within a secure complex."}
{"input": "4 bedrooms, 2 bathrooms, Bloemfontein, family home, large yard, fireplace, double carport", "output": "Comfortable 4-bedroom family home in Bloemfontein with a spacious yard, cozy fireplace, and double carport."}
{"input": "2 bedrooms, 2 bathrooms, East London, apartment, river views, balcony, 24hr security", "output": "Modern 2-bedroom apartment in East London offering river views, a private balcony, and 24-hour security."}
{"input": "3 bedrooms, 1 bathroom, Kimberley, house, renovated kitchen, garden, single garage", "output": "Neat 3-bedroom house in Kimberley featuring a renovated kitchen, well-maintained garden, and a single garage."}
{"input": "5 bedrooms, 3 bathrooms, Nelspruit, freestanding house, pool, entertainment area, double garage", "output": "Spacious 5-bedroom freestanding house in Nelspruit with a sparkling pool, dedicated entertainment area, and double garage."}
{"input": "2 bedrooms, 1 bathroom, George, townhouse, open-plan living, private garden, pet-friendly", "output": "Charming 2-bedroom townhouse in George with open-plan living spaces, a private garden, and pet-friendly amenities."}
{"input": "4 bedrooms, 3 bathrooms, Polokwane, modern house, study, pool, double garage", "output": "Contemporary 4-bedroom house in Polokwane featuring a private study, refreshing pool, and double garage."}
{"input": "3 bedrooms, 2 bathrooms, Pietermaritzburg, duplex, balcony, secure complex, garage", "output": "Modern 3-bedroom duplex in Pietermaritzburg with a private balcony, located in a secure complex, and includes a garage."}
{"input": "2 bedrooms, 1 bathroom, Rustenburg, apartment, ground floor, garden access, parking bay", "output": "Convenient 2-bedroom ground floor apartment in Rustenburg with direct garden access and a dedicated parking bay."}
{"input": "4 bedrooms, 2 bathrooms, East London, family home, large yard, braai area, double carport", "output": "Spacious 4-bedroom family home in East London featuring a large yard, built-in braai area, and double carport."}
{"input": "3 bedrooms, 2 bathrooms, Vereeniging, townhouse, modern kitchen, patio, single garage", "output": "Stylish 3-bedroom townhouse in Vereeniging with a modern kitchen, cozy patio, and single garage."}
{"input": "2 bedrooms, 1 bathroom, Port Shepstone, apartment, sea views, balcony, secure parking", "output": "Bright 2-bedroom apartment in Port Shepstone offering sea views, a private balcony, and secure parking."}
{"input": "5 bedrooms, 4 bathrooms, Pretoria East, luxury home, landscaped garden, pool, triple garage", "output": "Luxurious 5-bedroom home in Pretoria East with a beautifully landscaped garden, sparkling pool, and triple garage."}
{"input": "1 bedroom, 1 bathroom, Cape Town CBD, studio apartment, modern finishes, rooftop terrace", "output": "Contemporary 1-bedroom studio apartment in Cape Town CBD featuring modern finishes and access to a rooftop terrace."}
{"input": "3 bedrooms, 2 bathrooms, Bloemfontein, freestanding house, garden, fireplace, double garage", "output": "Charming 3-bedroom freestanding house in Bloemfontein with a lush garden, cozy fireplace, and double garage."}
{"input": "4 bedrooms, 3 bathrooms, Durban North, family home, pool, entertainment area, double garage", "output": "Spacious 4-bedroom family home in Durban North featuring a sparkling pool, entertainment area, and double garage."}
{"input": "2 bedrooms, 2 bathrooms, Knysna, apartment, lagoon views, balcony, secure complex", "output": "Elegant 2-bedroom apartment in Knysna offering lagoon views, a private balcony, and located within a secure complex."}
{"input": "3 bedrooms, 1 bathroom, Kimberley, house, renovated kitchen, garden, single garage", "output": "Well-maintained 3-bedroom house in Kimberley featuring a renovated kitchen, neat garden, and single garage."}
{"input": "5 bedrooms, 3 bathrooms, Nelspruit, freestanding house, pool, entertainment area, double garage", "output": "Expansive 5-bedroom freestanding house in Nelspruit with a sparkling pool, dedicated entertainment area, and double garage."}
{"input": "2 bedrooms, 1 bathroom, George, townhouse, open-plan living, private garden, pet-friendly", "output": "Cozy 2-bedroom townhouse in George with open-plan living spaces, a private garden, and pet-friendly policy."}
{"input": "4 bedrooms, 3 bathrooms, Polokwane, modern house, study, pool, double garage", "output": "Modern 4-bedroom house in Polokwane featuring a private study, refreshing pool, and double garage."}
{"input": "3 bedrooms, 2 bathrooms, Pietermaritzburg, duplex, balcony, secure complex, garage", "output": "Contemporary 3-bedroom duplex in Pietermaritzburg with a private balcony, situated in a secure complex, and includes a garage."}
{"input": "2 bedrooms, 1 bathroom, Rustenburg, apartment, ground floor, garden access, parking bay", "output": "Ground floor 2-bedroom apartment in Rustenburg with direct garden access and a dedicated parking bay."}
{"input": "4 bedrooms, 2 bathrooms, East London, family home, large yard, braai area, double carport", "output": "Family-friendly 4-bedroom home in East London featuring a spacious yard, built-in braai area, and double carport."}
{"input": "3 bedrooms, 2 bathrooms, Vereeniging, townhouse, modern kitchen, patio, single garage", "output": "Modern 3-bedroom townhouse in Vereeniging with a sleek kitchen, cozy patio, and single garage."}
{"input": "2 bedrooms, 1 bathroom, Port Shepstone, apartment, sea views, balcony, secure parking", "output": "Bright 2-bedroom apartment in Port Shepstone offering stunning sea views, a private balcony, and secure parking."}
{"input": "5 bedrooms, 4 bathrooms, Pretoria East, luxury home, landscaped garden, pool, triple garage", "output": "Luxurious 5-bedroom home in Pretoria East with a beautifully landscaped garden, sparkling pool, and triple garage."}
{"input": "1 bedroom, 1 bathroom, Cape Town CBD, studio apartment, modern finishes, rooftop terrace", "output": "Contemporary 1-bedroom studio apartment in Cape Town CBD featuring modern finishes and access to a rooftop terrace."}
{"input": "3 bedrooms, 2 bathrooms, Bloemfontein, freestanding house, garden, fireplace, double garage", "output": "Charming 3-bedroom freestanding house in Bloemfontein with a lush garden, cozy fireplace, and double garage."}
{"input": "4 bedrooms, 3 bathrooms, Durban North, family home, pool, entertainment area, double garage", "output": "Spacious 4-bedroom family home in Durban North featuring a sparkling pool, entertainment area, and double garage."}
{"input": "2 bedrooms, 2 bathrooms, Knysna, apartment, lagoon views, balcony, secure complex", "output": "Elegant 2-bedroom apartment in Knysna offering lagoon views, a private balcony, and located within a secure complex."}
{"input": "3 bedrooms, 1 bathroom, Kimberley, house, renovated kitchen, garden, single garage", "output": "Well-maintained 3-bedroom house in Kimberley featuring a renovated kitchen, neat garden, and single garage."}
{"input": "5 bedrooms, 3 bathrooms, Nelspruit, freestanding house, pool, entertainment area, double garage", "output": "Expansive 5-bedroom freestanding house in Nelspruit with a sparkling pool, dedicated entertainment area, and double garage."}
{"input": "2 bedrooms, 1 bathroom, George, townhouse, open-plan living, private garden, pet-friendly", "output": "Cozy 2-bedroom townhouse in George with open-plan living spaces, a private garden, and pet-friendly policy."}
{"input": "4 bedrooms, 3 bathrooms, Polokwane, modern house, study, pool, double garage", "output": "Modern 4-bedroom house in Polokwane featuring a private study, refreshing pool, and double garage."}
{"input": "3 bedrooms, 2 bathrooms, Pietermaritzburg, duplex, balcony, secure complex, garage", "output": "Contemporary 3-bedroom duplex in Pietermaritzburg with a private balcony, situated in a secure complex, and includes a garage."}
{"input": "2 bedrooms, 1 bathroom, George, townhouse, open-plan living, private garden, pet-friendly", "output": "Cozy 2-bedroom townhouse in George featuring open-plan living, a private garden, and pet-friendly amenities."}
{"input": "4 bedrooms, 3 bathrooms, Polokwane, modern house, study, pool, double garage", "output": "Modern 4-bedroom house in Polokwane with a dedicated study, refreshing pool, and a spacious double garage."}
{"input": "3 bedrooms, 2 bathrooms, Pietermaritzburg, duplex, balcony, secure complex, garage", "output": "Contemporary 3-bedroom duplex in Pietermaritzburg offering a private balcony, secure complex living, and an attached garage."}
{"input": "2 bedrooms, 2 bathrooms, Cape Town, apartment, sea views, balcony, secure parking", "output": "Stylish 2-bedroom apartment in Cape Town boasting sea views, a private balcony, and secure parking facilities."}
{"input": "5 bedrooms, 4 bathrooms, Durban, freestanding house, garden, pool, triple garage", "output": "Spacious 5-bedroom freestanding house in Durban featuring a lush garden, sparkling pool, and a triple garage."}
{"input": "1 bedroom, 1 bathroom, Sandton, studio apartment, modern finishes, rooftop terrace", "output": "Chic 1-bedroom studio apartment in Sandton with modern finishes and access to a rooftop terrace."}
{"input": "3 bedrooms, 2 bathrooms, Bloemfontein, townhouse, open-plan kitchen, patio, double garage", "output": "Elegant 3-bedroom townhouse in Bloemfontein offering an open-plan kitchen, cozy patio, and a double garage."}
{"input": "4 bedrooms, 2 bathrooms, East London, family home, large yard, entertainment area", "output": "Comfortable 4-bedroom family home in East London with a spacious yard and dedicated entertainment area."}
{"input": "2 bedrooms, 1 bathroom, Port Elizabeth, apartment, city views, balcony, secure complex", "output": "Modern 2-bedroom apartment in Port Elizabeth featuring city views, a private balcony, and located within a secure complex."}
{"input": "3 bedrooms, 2 bathrooms, Pretoria, duplex, garden, pet-friendly, garage", "output": "Charming 3-bedroom duplex in Pretoria with a private garden, pet-friendly policy, and an attached garage."}
{"input": "5 bedrooms, 3 bathrooms, Johannesburg, luxury house, pool, home office, double garage", "output": "Luxurious 5-bedroom house in Johannesburg featuring a private pool, dedicated home office, and a double garage."}
{"input": "2 bedrooms, 1 bathroom, Knysna, cottage, lagoon views, deck, secure parking", "output": "Quaint 2-bedroom cottage in Knysna offering lagoon views, a wooden deck, and secure parking."}
{"input": "4 bedrooms, 3 bathrooms, Stellenbosch, modern house, wine cellar, garden, double garage", "output": "Contemporary 4-bedroom house in Stellenbosch with a wine cellar, landscaped garden, and a double garage."}
{"input": "3 bedrooms, 2 bathrooms, Nelspruit, townhouse, open-plan living, patio, single garage", "output": "Neat 3-bedroom townhouse in Nelspruit featuring open-plan living, a cozy patio, and a single garage."}
{"input": "2 bedrooms, 2 bathrooms, Ballito, apartment, ocean views, balcony, secure estate", "output": "Stunning 2-bedroom apartment in Ballito with ocean views, a private balcony, and situated in a secure estate."}
{"input": "4 bedrooms, 2 bathrooms, Kimberley, freestanding house, garden, pool, double carport", "output": "Spacious 4-bedroom freestanding house in Kimberley featuring a lush garden, sparkling pool, and a double carport."}
{"input": "1 bedroom, 1 bathroom, Hermanus, studio apartment, sea views, modern finishes", "output": "Modern 1-bedroom studio apartment in Hermanus offering sea views and contemporary finishes."}
{"input": "3 bedrooms, 2 bathrooms, George, duplex, private garden, pet-friendly, garage", "output": "Comfortable 3-bedroom duplex in George with a private garden, pet-friendly amenities, and an attached garage."}
{"input": "5 bedrooms, 4 bathrooms, Polokwane, luxury villa, pool, landscaped garden, triple garage", "output": "Exquisite 5-bedroom luxury villa in Polokwane featuring a private pool, landscaped garden, and a triple garage."}
{"input": "2 bedrooms, 1 bathroom, Durban, apartment, city views, balcony, secure parking", "output": "Contemporary 2-bedroom apartment in Durban offering city views, a private balcony, and secure parking."}
